[
  {
    "name": "Aarakocra",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 20,
      "fly": 50
    },
    "ability": [
      {
        "dex": 2,
        "wis": 2
      }
    ],
    "entries": "**Dive Attack**：If you are flying and dive at least 30 ft. straight toward a target and then hit it with a melee weapon attack, the attack deals an extra 1d6 damage to the target.\n**Talons**：You are proficient with your unarmed strikes, which deal 1d4 slashing damage on a hit.\n**Language**：You can speak, read, and write Auran."
  },
  {
    "name": "Aarakocra",
    "source": "EEPC",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 25,
      "fly": 50
    },
    "ability": [
      {
        "dex": 2,
        "wis": 1
      }
    ],
    "entries": "**Age**：Aarakocra reach maturity by age 3. Compared to humans, aarakocra don't usually live longer than 30 years.\n**Alignment**：Most aarakocra are good and rarely choose sides when it comes to law and chaos. Tribal leaders and warriors might be lawful, while explorers and adventurers might tend toward chaotic.\n**Size**：Aarakocra are about 5 feet tall. They have thin, lightweight bodies that weigh between 80 and 100 pounds. Your size is Medium.\n**Flight**：You have a flying speed of 50 feet. To use this speed, you can't be wearing medium or heavy armor.\n**Talons**：Your talons are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n**Language**：You can speak, read, and write Common, Aarakocra, and Auran."
  },
  {
    "name": "Aarakocra",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "fly": true
    },
    "ability": {},
    "entries": "**Flight**：Because of your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor.\n**Talons**：You have talons that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike.\n**Wind Caller**：Starting at 3rd level, you can cast the gust of wind spell with this trait, without requiring a material component. Once you cast the spell with this trait, you can't do so again until you finish a long rest. You can also cast the spell using any spell slots you have of 2nd level or higher.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for when you cast gust of wind with this trait (choose when you select this race)."
  },
  {
    "name": "Aasimar",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "wis": 1,
        "cha": 2
      }
    ],
    "entries": "**Age**：Aasimar mature at the same rate as humans but live a few years longer.\n**Size**：Aasimar are built like well-proportioned humans. Your size is Medium.\n**Darkvision**：Thanks to your celestial heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of grey.\n**Celestial Resistance**：You have resistance to necrotic and radiant damage.\n**Celestial Legacy**：You know the light cantrip. Once you reach 3rd level, you can cast the lesser restoration spell once with this trait, and you regain the ability to do so when you finish a long rest. Once you reach 5th level, you can cast the daylight spell once with this trait, and you regain the ability to do so when you finish a long rest. Charisma is your spellcasting ability for these spells.\n**Language**：You can speak, read, and write Common and Celestial."
  },
  {
    "name": "Aasimar",
    "source": "MPMM",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Size**：You are Medium or Small. You choose the size when you select this race.\n**Celestial Resistance**：You have resistance to necrotic damage and radiant damage.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Healing Hands**：As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can't use it again until you finish a long rest.\n**Light Bearer**：You know the light cantrip. Charisma is your spellcasting ability for it.\n**Celestial Revelation**：When you reach 3rd level, choose one of the revelation options below. Thereafter, you can use a bonus action to unleash the celestial energy within yourself, gaining the benefits of that revelation. Your transformation lasts for 1 minute or until you end it as a bonus action. Once you transform using your revelation below, you can't use it again until you finish a long rest.\n• {'type': 'item', 'name': 'Necrotic Shroud', 'entry': 'Your eyes briefly become pools of darkness, and ghostly, flightless wings sprout from your back temporarily. Creatures other than your allies within 10 feet of you that can see you must succeed on a Charisma saving throw ({@dc 8} + your proficiency bonus + your Charisma modifier) or become {@condition frightened} of you until the end of your next turn. Until the transformation ends, once on each of your turns, you can deal extra necrotic damage to one target when you deal damage to it with an attack or a spell. The extra damage equals your proficiency bonus.'}\n• {'type': 'item', 'name': 'Radiant Consumption', 'entry': 'Searing light temporarily radiates from your eyes and mouth. For the duration, you shed bright light in a 10-foot radius and dim light for an additional 10 feet, and at the end of each of your turns, each creature within 10 feet of you takes radiant damage equal to your proficiency bonus. Until the transformation ends, once on each of your turns, you can deal extra radiant damage to one target when you deal damage to it with an attack or a spell. The extra damage equals your proficiency bonus.'}\n• {'type': 'item', 'name': 'Radiant Soul', 'entry': 'Two luminous, spectral wings sprout from your back temporarily. Until the transformation ends, you have a flying speed equal to your walking speed, and once on each of your turns, you can deal extra radiant damage to one target when you deal damage to it with an attack or a spell. The extra damage equals your proficiency bonus.'}"
  },
  {
    "name": "Aasimar",
    "source": "VGM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "cha": 2
      }
    ],
    "entries": "**Age**：Aasimar mature at the same rate as humans, but they can live up to 160 years.\n**Size**：Aasimar have the same range of height and weight as humans.\n**Darkvision**：Blessed with a radiant soul, your vision can easily cut through darkness. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Celestial Resistance**：You have resistance to necrotic damage and radiant damage.\n**Healing Hands**：As an action, you can touch a creature and cause it to regain a number of hit points equal to your level. Once you use this trait, you can't use it again until you finish a long rest.\n**Light Bearer**：You know the light cantrip. Charisma is your spellcasting ability for it.\n**Languages**：You can speak, read, and write Common and Celestial."
  },
  {
    "name": "Aasimar",
    "source": "XPHB",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Celestial Resistance**：You have Resistance to Necrotic damage and Radiant damage.\n**Darkvision**：You have Darkvision with a range of 60 feet.\n**Healing Hands**：As a Magic action, you touch a creature and roll a number of d4s equal to your Proficiency. The creature regains a number of Hit Points equal to the total rolled. Once you use this trait, you can't use it again until you finish a Long Rest.\n**Light Bearer**：You know the Light cantrip. Charisma is your spellcasting ability for it.\n**Celestial Revelation**：When you reach character level 3, you can transform as a Bonus Action using one of the options below (choose the option each time you transform). The transformation lasts for 1 minute or until you end it (no action required). Once you transform, you can't do so again until you finish a Long Rest.\nOnce on each of your turns before the transformation ends, you can deal extra damage to one target when you deal damage to it with an attack or a spell. The extra damage equals your Proficiency, and the extra damage's type is either Necrotic for Necrotic Shroud or Radiant for Heavenly Wings and Inner Radiance.\nHere are the transformation options:\n• {'type': 'item', 'name': 'Heavenly Wings', 'entries': ['Two spectral wings sprout from your back temporarily. Until the transformation ends, you have a {@variantrule Fly Speed|XPHB} equal to your {@variantrule Speed|XPHB}.']}\n• {'type': 'item', 'name': 'Inner Radiance', 'entries': ['Searing light temporarily radiates from your eyes and mouth. For the duration, you shed {@variantrule Bright Light|XPHB} in a 10-foot radius and {@variantrule Dim Light|XPHB} for an additional 10 feet, and at the end of each of your turns, each creature within 10 feet of you takes Radiant damage equal to your {@variantrule Proficiency|XPHB|Proficiency Bonus}.']}\n• {'type': 'item', 'name': 'Necrotic Shroud', 'entries': ['Your eyes briefly become pools of darkness, and flightless wings sprout from your back temporarily. Creatures other than your allies within 10 feet of you must succeed on a Charisma saving throw ({@dc 8} plus your Charisma modifier and {@variantrule Proficiency|XPHB|Proficiency Bonus}) or have the {@condition Frightened|XPHB} condition until the end of your next turn.']}"
  },
  {
    "name": "Aetherborn",
    "source": "PSK",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "cha": 2,
        "choose": {
          "from": [
            "str",
            "dex",
            "con",
            "int",
            "wis"
          ],
          "count": 2
        }
      }
    ],
    "entries": "**Age**：Aetherborn come into being as adults and live no more than a few years.\n**Alignment**：As a rule, aetherborn are driven by hedonism and self-interest, making them neutral at best and thoroughly evil at worst. Neutral aetherborn might devote much of their time (and wealth) to parties and social activity, while evil aetherborn are usually involved in the criminal underworld.\n**Size**：Aetherborn are about the same size as humans, ranging from 5 to 6 feet tall. They are quite light—only about 100 pounds—and their weight diminishes as they age and more and more of their substance returns to the aethersphere. Your size is Medium.\n**Darkvision**：Thanks to your heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Born of Aether**：You have resistance to necrotic damage.\n**Menacing**：You have proficiency in the Intimidation skill.\n**Languages**：You can speak, read, and write Common and two other languages of your choice.\nAn unknown aetherborn, desperately seeking a means to extend their short life, discovered a process of transformation that prolonged their existence—by giving them the ability to feed on the life essence of other beings. Since then, other aetherborn have learned and carried out this monstrous transformation, and aetherborn with this \"gift\" have become a small minority among an already small population.\nA gifted aetherborn has the ability to drain the life essence of other beings. Similar to the way heat is transferred from a warm object to a cold one, a gifted aetherborn need only touch another living being with a clawed hand to draw life essence out, fueling their own continued existence while draining strength and vitality from their victim.\nFor many aetherborn, living as they do for indulgence and instant gratification, the concepts of \"want\" and \"need\" are virtually synonymous. But Aetherborn with this gift understand what it is to truly need, for they develop a hunger for life essence that far exceeds any desires they might have felt before their transformation. A gifted aetherborn who abstains from this feeding deteriorates even more rapidly than other aetherborn, while enduring unspeakable agony caused by the deprivation of life energy.\nAt the DM's option, an aetherborn character can research methods of achieving this dark \"gift.\" The process is similar to inventing and manufacturing a rare magic item (see \"Inventing and Manufacturing Devices\" earlier in this document). But rather than aether, the process requires a variety of rare unguents and unusual ingredients that make up the cost of researching and undergoing the transformation.\nAn aetherborn with this gift gains the Drain Life ability: a natural attack that deals 1d6 necrotic damage and restores the same number of hit points to the aetherborn. However, if the aetherborn goes for 7 days without dealing this damage, their hit point maximum is reduced by 1d6 per week. This reduction can't be removed until the aetherborn has used their Drain Life ability and completed a long rest."
  },
  {
    "name": "Astral Elf",
    "source": "AAG",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are a Humanoid. You are also considered an elf for any prerequisite or effect that requires you to be an elf.\n**Astral Fire**：You know one of the following cantrips of your choice: dancing lights, light, or sacred flame. Intelligence, Wisdom, or Charisma is your spellcasting ability for it (choose when you select this race).\n**Darkvision**：You can see in dim light within 60 feet of yourself as if it were bright light, and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Fey Ancestry**：You have advantage on saving throws you make to avoid or end the charmed condition on yourself.\n**Keen Senses**：You have proficiency in the Perception skill.\n**Starlight Step**：As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n**Astral Trance**：You don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in a trancelike meditation, during which you remain conscious.\nWhenever you finish this trance, you gain proficiency in one skill of your choice and with one weapon or tool of your choice, selected from the Player's Handbook. You mystically acquire these proficiencies by drawing them from shared elven memory and the experiences of entities on the Astral Plane, and you retain them until you finish your next long rest."
  },
  {
    "name": "Autognome",
    "source": "AAG",
    "size": [
      "S"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are a Construct.\n**Armored Casing**：You are encased in thin metal or some other durable material. While you aren't wearing armor, your base Armor Class is 13 + your Dexterity modifier.\n**Built for Success**：You can add a d4 to one attack roll, ability check, or saving throw you make, and you can do so after seeing the d20 roll but before the effects of the roll are resolved. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n**Healing Machine**：If the mending spell is cast on you, you can spend a Hit Die, roll it, and regain a number of hit points equal to the roll plus your Constitution modifier (minimum of 1 hit point).\nIn addition, your creator designed you to benefit from several spells that preserve life but that normally don't affect Constructs: cure wounds, healing word, mass cure wounds, mass healing word, and spare the dying.\n**Mechanical Nature**：You have resistance to poison damage and immunity to disease, and you have advantage on saving throws against being paralyzed or poisoned. You don't need to eat, drink, or breathe.\n**Sentry's Rest**：When you take a long rest, you spend at least 6 hours in an inactive, motionless state, instead of sleeping. In this state, you appear inert, but you remain conscious.\n**Specialized Design**：You gain two tool proficiencies of your choice, selected from the Player's Handbook."
  },
  {
    "name": "Aven",
    "source": "PSA",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 25,
      "fly": 30
    },
    "ability": [
      {
        "dex": 2
      }
    ],
    "entries": "**Age**：Like humans, aven reach adulthood in their late teens and can theoretically live into their 80s. Of course, most find a glorious (or inglorious) death long before that point.\n**Alignment**：Most aven lean toward some form of neutrality. Ibis-headed aven, focused more on knowledge than any other virtue, are usually neutral. Hawk-headed aven are inclined toward lawful neutral.\n**Size**：Aven stand from 5 to 6 feet tall, but their bodies are slender and their bones are partially hollow to facilitate their flight. Your size is Medium.\n**Flight**：You have a flying speed of 30 feet. You can't use your flying speed while you wear medium or heavy armor. (If your campaign uses the variant rule for encumbrance, you can't use your flying speed if you are encumbered.)\n**Languages**：You can speak, read, and write Common and Aven."
  },
  {
    "name": "Aven",
    "source": "PSD",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 25,
      "fly": 30
    },
    "ability": [
      {
        "dex": 2,
        "wis": 2
      }
    ],
    "entries": "**Age**：Like humans, aven reach adulthood in their late teens and can live into their 80s.\n**Alignment**：Aven are inclined toward the lawful good alignment of the Church of Serra\n**Size**：Aven stand from 5 to 6 feet tall, but their bodies are slender and their bones are partially hollow to facilitate their flight. Your size is Medium.\n**Flight**：You have a flying speed of 30 feet. You can't use your flying speed while you wear medium or heavy armor. (If your campaign uses the variant rule for encumbrance, you can't use your flying speed if you are encumbered.)\n**Languages**：You can speak, read, and write Common and Aven.\n**Hawkeyed**：You have proficiency in the Perception skill. In addition, attacking at long range doesn't impose disadvantage on your ranged weapon attack rolls."
  },
  {
    "name": "Boggart",
    "source": "LFL",
    "size": [],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Bugbear",
    "source": "ERLW",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "dex": 1
      }
    ],
    "entries": "**Age**：Bugbears reach adulthood at age 16 and live up to 80 years.\n**Alignment**：Bugbears live on the fringes of society even in Darguun, where they value self-sufficiency and violence. They are generally chaotic, organizing in loose tribes under charismatic and powerful leaders.\n**Size**：Your size is Medium.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Long-Limbed**：When you make a melee attack on your turn, your reach for it is 5 feet greater than normal.\n**Powerful Build**：You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.\n**Sneaky**：You are proficient in the Stealth skill.\n**Surprise Attack**：If you surprise a creature and hit it with an attack on your first turn in combat, the attack deals an extra 2d6 damage to it. You can use this trait only once per combat.\n**Languages**：You can speak, read, and write Common and Goblin."
  },
  {
    "name": "Bugbear",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are a Humanoid. You are also considered a goblinoid for any prerequisite or effect that requires you to be a goblinoid.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Fey Ancestry**：You have advantage on saving throws you make to avoid or end the charmed condition on yourself.\n**Long-Limbed**：When you make a melee attack on your turn, your reach for it is 5 feet greater than normal.\n**Powerful Build**：You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.\n**Sneaky**：You are proficient in the Stealth skill. In addition, without squeezing, you can move through and stop in a space large enough for a Small creature.\n**Surprise Attack**：If you hit a creature with an attack roll, the creature takes an extra 2d6 damage if it hasn't taken a turn yet in the current combat."
  },
  {
    "name": "Bugbear",
    "source": "VGM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "dex": 1
      }
    ],
    "entries": "**Age**：Bugbears reach adulthood at age 16 and live up to 80 years.\n**Size**：Bugbears are between 6 and 8 feet tall and weigh between 250 and 350 pounds. Your size is Medium.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Long-Limbed**：When you make a melee attack on your turn, your reach for it is 5 feet greater than normal.\n**Powerful Build**：You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.\n**Sneaky**：You are proficient in the Stealth skill.\n**Surprise Attack**：If you surprise a creature and hit it with an attack on your first turn in combat, the attack deals an extra 2d6 damage to it. You can use this trait only once per combat.\n**Languages**：You can speak, read, and write Common and Goblin."
  },
  {
    "name": "Bullywug",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 20,
      "swim": 40
    },
    "ability": [
      {
        "int": -2,
        "cha": -2
      }
    ],
    "entries": "**Amphibious**：You can breathe air and water.\n**Speak with Frogs and Toads**：You can communicate simple concepts to frogs and toads when you speak in Bullywug.\n**Swamp Camouflage**：You have advantage on Dexterity (Stealth) checks made to hide in swampy terrain.\n**Standing Leap**：Your long jump is up to 20 feet and your high jump is up to 10 feet, with or without a running start.\n**Languages**：You can speak, read, and write Bullywug."
  },
  {
    "name": "Centaur",
    "source": "GGR",
    "size": [
      "M"
    ],
    "speed": 40,
    "ability": [
      {
        "str": 2,
        "wis": 1
      }
    ],
    "entries": "**Age**：Centaurs mature and age at about the same rate as humans.\n**Alignment**：Centaurs are inclined toward neutrality. Those who join the Selesnya are more often neutral good, while those who join the Gruul are typically chaotic neutral.\n**Size**：Centaurs stand between 6 and 7 feet tall, with their equine bodies reaching about 4 feet at the withers. Your size is Medium.\n**Fey**：Your creature type is fey, rather than humanoid.\n**Charge**：If you move at least 30 feet straight toward a target and then hit it with a melee weapon attack on the same turn, you can immediately follow that attack with a bonus action, making one attack against the target with your hooves.\n**Hooves**：Your hooves are natural melee weapons, which you can use to make unarmed strikes. If you hit with them, you deal bludgeoning damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n**Equine Build**：You count as one size larger when determining your carrying capacity and the weight you can push or drag.\nIn addition, any climb that requires hands and feet is especially difficult for you because of your equine legs. When you make such a climb, each foot of movement costs you 4 extra feet, instead of the normal 1 extra foot.\n**Survivor**：You have proficiency in one of the following skills of your choice: Animal Handling, Medicine, Nature, or Survival.\n**Languages**：You can speak, read, and write Common and Sylvan. Sylvan is widely spoken in the Selesnya Conclave, for it is rich in vocabulary to describe natural phenomena and spiritual forces."
  },
  {
    "name": "Centaur",
    "source": "MOT",
    "size": [],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Centaur",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 40,
    "ability": {},
    "entries": "**Creature Type**：You are a Fey.\n**Charge**：If you move at least 30 feet straight toward a target and then hit it with a melee weapon attack on the same turn, you can immediately follow that attack with a bonus action, making one attack against the target with your hooves.\n**Equine Build**：You count as one size larger when determining your carrying capacity and the weight you can push or drag.\nIn addition, any climb that requires hands and feet is especially difficult for you because of your equine legs. When you make such a climb, each foot of movement costs you 4 extra feet instead of the normal 1 extra foot.\n**Hooves**：You have hooves that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier bludgeoning damage, instead of the bludgeoning damage normal for an unarmed strike.\n**Natural Affinity**：Your fey connection to nature gives you an intuitive connection to the natural world and the animals within it. You therefore have proficiency in one of the following skills of your choice: Animal Handling, Medicine, Nature, or Survival."
  },
  {
    "name": "Changeling",
    "source": "EFA",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Changeling Instincts**：Thanks to your connection to the fey realm, you gain proficiency in two of the following skills of your choice: Deception, Insight, Intimidation, Performance, or Persuasion.\n**Shape-Shifter**：As an action, you can shape-shift to change your appearance and your voice. You determine the specifics of the changes, including your coloration, hair length, and sex. You can also adjust your height and weight and can change your size between Medium and Small. You can make yourself appear as a member of another playable species, though none of your game statistics change. You can't duplicate the appearance of an individual you've never seen, and you must adopt a form that has the same basic arrangement of limbs that you have. This trait doesn't change your clothing and equipment.\nWhile shape-shifted with this trait, you have Advantage on Charisma checks.\nYou stay in the new form until you take an action to revert to your true form."
  },
  {
    "name": "Changeling",
    "source": "ERLW",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "cha": 2,
        "choose": {
          "from": [
            "str",
            "dex",
            "con",
            "int",
            "wis"
          ],
          "count": 1
        }
      }
    ],
    "entries": "**Age**：Changelings mature slightly faster than humans but share a similar lifespan—typically a century or less. While a changeling can transform to conceal their age, the effects of aging affect them similarly to humans.\n**Alignment**：Changelings tend toward pragmatic neutrality, and few changelings embrace evil.\n**Size**：Your size is Medium.\n**Shapechanger**：As an action, you can change your appearance and your voice. You determine the specifics of the changes, including your coloration, hair length, and sex. You can also adjust your height and weight, but not so much that your size changes. You can make yourself appear as a member of another race, though none of your game statistics change. You can't duplicate the appearance of a creature you've never seen, and you must adopt a form that has the same basic arrangement of limbs that you have. Your clothing and equipment aren't changed by this trait.\nYou stay in the new form until you use an action to revert to your true form or until you die.\n**Changeling Instincts**：You gain proficiency with two of the following skills of your choice: Deception, Insight, Intimidation, and Persuasion.\n**Languages**：You can speak, read, and write Common and two other languages of your choice."
  },
  {
    "name": "Changeling",
    "source": "MPMM",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are a Fey.\n**Size**：You are Medium or Small. You choose the size when you select this race.\n**Changeling Instincts**：Thanks to your connection to the fey realm, you gain proficiency with two of the following skills of your choice: Deception, Insight, Intimidation, Performance, or Persuasion.\n**Shapechanger**：As an action, you change your appearance and your voice. You determine the specifics of the changes, including your coloration, hair length, and sex. You can also adjust your height between Medium and Small. You can make yourself appear as a member of another race, though none of your game statistics change. You can't duplicate the appearance of an individual you've never seen, and you must adopt a form that has the same basic arrangement of limbs that you have. Your clothing and equipment aren't changed by this trait.\nYou stay in the new form until you use an action to revert to your true form or until you die."
  },
  {
    "name": "Custom Lineage",
    "source": "TCE",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "choose": {
          "from": [
            "str",
            "dex",
            "con",
            "int",
            "wis",
            "cha"
          ],
          "amount": 2
        }
      }
    ],
    "entries": "Instead of choosing one of the game's races for your character at 1st level, you can use the following traits to represent your character's lineage, giving you full control over how your character's origin shaped them:\n**Creature Type**：You are a humanoid. You determine your appearance and whether you resemble any of your kin.\n**Size**：You are Small or Medium (your choice).\n**Feat**：You gain one feat of your choice for which you qualify.\n**Variable Trait**：You gain one of the following options of your choice: (a) darkvision with a range of 60 feet or (b) proficiency in one skill of your choice.\n**Languages**：You can speak, read, and write Common and one other language that you and your DM agree is appropriate for your character.\nYour race is considered to be a Custom Lineage for any game feature that requires a certain race, such as elf or dwarf."
  },
  {
    "name": "Deep Gnome",
    "source": "MPMM",
    "size": [
      "S"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are a Humanoid. You are also considered a gnome for any prerequisite or effect that requires you to be a gnome.\n**Darkvision**：You can see in dim light within 120 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Gift of the Svirfneblin**：Starting at 3rd level, you can cast the disguise self spell with this trait. Starting at 5th level, you can also cast the nondetection spell with it, without requiring a material component. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these using spell slots you have of the appropriate level.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race).\n**Gnomish Magic Resistance**：You have advantage on Intelligence, Wisdom, and Charisma saving throws against spells.\n**Svirfneblin Camouflage**：When you make a Dexterity (Stealth) check, you can make the check with advantage. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
  },
  {
    "name": "Dhampir",
    "source": "ABH",
    "size": [
      "S",
      "M"
    ],
    "speed": {
      "walk": 35,
      "climb": true
    },
    "ability": {},
    "entries": "**Darkvision**：You have Darkvision with a range of 60 feet.\n**Spider Climb**：You have a Climb Speed equal to your Speed. When you reach character level 3, you can move up, down, and across vertical surfaces and along ceilings while leaving your hands free.\n**Trace of Undeath**：You have Resistance to Necrotic damage.\n**Vampiric Bite**：When you use your Unarmed Strike and deal damage, you can choose to bite with your fangs. You deal Piercing damage equal to 1d4 plus your Constitution modifier instead of the normal damage of an Unarmed Strike.\nIn addition, when you deal this damage to a creature that isn't a Construct or an Undead, you can empower yourself in one of the following ways:\n• {'type': 'item', 'name': 'Drain', 'entries': ['You regain {@variantrule Hit Points|XPHB} equal to the Piercing damage dealt.']}\n• {'type': 'item', 'name': 'Strengthen', 'entries': ['You gain a bonus to the next ability check or attack roll you make within the next minute; the bonus is equal to the Piercing damage dealt.']}\nYou can empower yourself with this trait a number of times equal to your Proficiency, and you regain all expended uses when you finish a Long Rest."
  },
  {
    "name": "Dhampir",
    "source": "VRGR",
    "size": [
      "S",
      "M"
    ],
    "speed": {
      "walk": 35,
      "climb": true
    },
    "ability": {},
    "entries": "**Size**：You are Medium or Small. You choose the size when you gain this lineage.\n**Ancestral Legacy**：If you replace a race with this lineage, you can keep the following elements of that race: any skill proficiencies you gained from it and any climbing, flying, or swimming speed you gained from it.\nIf you don't keep any of those elements or you choose this lineage at character creation, you gain proficiency in two skills of your choice.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness as shades of gray.\n**Deathless Nature**：You don't need to breathe.\n**Spider Climb**：You have a climbing speed equal to your walking speed. In addition, at 3rd level, you can move up, down, and across vertical surfaces and upside down along ceilings, while leaving your hands free.\n**Vampiric Bite**：Your fanged bite is a natural weapon, which counts as a simple melee weapon with which you are proficient. You add your Constitution modifier, instead of your Strength modifier, to the attack and damage rolls when you attack with this bite. It deals 1d4 piercing damage on a hit. While you are missing half or more of your hit points, you have advantage on attack rolls you make with this bite.\nWhen you attack with this bite and hit a creature that isn't a Construct or an Undead, you can empower yourself in one of the following ways of your choice:\n• You regain hit points equal to the piercing damage dealt by the bite.\n• You gain a bonus to the next ability check or attack roll you make; the bonus equals the piercing damage dealt by the bite\nYou can empower yourself with this bite a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
  },
  {
    "name": "Dragonborn",
    "source": "PHB",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "cha": 1
      }
    ],
    "entries": "**Age**：Young dragonborn grow quickly. They walk hours after hatching, attain the size and development of a 10-year-old human child by the age of 3, and reach adulthood by 15. They live to be around 80.\n**Size**：Dragonborn are taller and heavier than humans, standing well over 6 feet tall and averaging almost 250 pounds. Your size is Medium.\n**Draconic Ancestry**：You have draconic ancestry. Choose one type of dragon from the Draconic Ancestry table. Your breath weapon and damage resistance are determined by the dragon type, as shown in the table.\n[表格: Draconic Ancestry]\n**Breath Weapon**：You can use your action to exhale destructive energy. Your draconic ancestry determines the size, shape, and damage type of the exhalation.\nWhen you use your breath weapon, each creature in the area of the exhalation must make a saving throw, the type of which is determined by your draconic ancestry. The DC for this saving throw equals 8 + your Constitution modifier + your proficiency bonus. A creature takes 2d6 damage on a failed save, and half as much damage on a successful one. The damage increases to 3d6 at 6th level, 4d6 at 11th level, and 5d6 at 16th level.\nAfter you use your breath weapon, you can't use it again until you complete a short or long rest.\n**Damage Resistance**：You have resistance to the damage type associated with your draconic ancestry.\n**Languages**：You can speak, read, and write Common and Draconic. Draconic is thought to be one of the oldest languages and is often used in the study of magic. The language sounds harsh to most other creatures and includes numerous hard consonants and sibilants."
  },
  {
    "name": "Dragonborn",
    "source": "XPHB",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Draconic Ancestry**：Your lineage stems from a dragon progenitor. Choose the kind of dragon from the Draconic Ancestors table. Your choice affects your Breath Weapon and Damage Resistance traits as well as your appearance.\n[表格: Draconic Ancestors]\n**Breath Weapon**：When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in either a 15-foot Cone [Area of Effect] or a 30-foot Line [Area of Effect] that is 5 feet wide (choose the shape each time). Each creature in that area must make a Dexterity saving throw (8 plus your Constitution modifier and Proficiency). On a failed save, a creature takes 1d10 damage of the type determined by your Draconic Ancestry trait. On a successful save, a creature takes half as much damage. This damage increases by 1d10 when you reach character levels 5 (2d10), 11 (3d10), and 17 (4d10).\nYou can use this Breath Weapon a number of times equal to your Proficiency, and you regain all expended uses when you finish a Long Rest.\n**Damage Resistance**：You have Resistance to the damage type determined by your Draconic Ancestry trait.\n**Darkvision**：You have Darkvision with a range of 60 feet.\n**Draconic Flight**：When you reach character level 5, you can channel draconic magic to give yourself temporary flight. As a Bonus Action, you sprout spectral wings on your back that last for 10 minutes or until you retract the wings (no action required) or have the Incapacitated condition. During that time, you have a Fly Speed equal to your Speed. Your wings appear to be made of the same energy as your Breath Weapon. Once you use this trait, you can't use it again until you finish a Long Rest."
  },
  {
    "name": "Dragonborn (Chromatic)",
    "source": "FTD",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Chromatic Ancestry**：You have a chromatic dragon ancestor, granting you a special magical affinity. Choose one kind of dragon from the Chromatic Ancestry table. This determines the damage type for your other traits, as shown in the table.\n[表格: Chromatic Ancestry]\n**Breath Weapon**：When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 30-foot line that is 5 feet wide. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 damage of the type associated with your Chromatic Ancestry. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).\nYou can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n**Draconic Resistance**：You have resistance to the damage type associated with your Chromatic Ancestry.\n**Chromatic Warding**：Starting at 5th level, as an action, you can channel your draconic energy to protect yourself. For 1 minute, you become immune to the damage type associated with your Chromatic Ancestry. Once you use this trait, you can't do so again until you finish a long rest."
  },
  {
    "name": "Dragonborn (Gem)",
    "source": "FTD",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Gem Ancestry**：You have a gem dragon ancestor, granting you a special magical affinity. Choose one kind of dragon from the Gem Ancestry table. This determines the damage type for your other traits, as shown in the table.\n[表格: Gem Ancestry]\n**Breath Weapon**：When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 15-foot cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 damage of the type associated with your Gem Ancestry. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).\nYou can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n**Draconic Resistance**：You have resistance to the damage type associated with your Gem Ancestry.\n**Psionic Mind**：You can send telepathic messages to any creature you can see within 30 feet of you. You don't need to share a language with the creature for it to understand these messages, but it must be able to understand at least one language to comprehend them.\n**Gem Flight**：Starting at 5th level, you can use a bonus action to manifest spectral wings on your body. These wings last for 1 minute. For the duration, you gain a flying speed equal to your walking speed and can hover. Once you use this trait, you can't do so again until you finish a long rest."
  },
  {
    "name": "Dragonborn (Metallic)",
    "source": "FTD",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Metallic Ancestry**：You have a metallic dragon ancestor, granting you a special magical affinity. Choose one kind of dragon from the Metallic Ancestry table. This determines the damage type for your other traits, as shown in the table.\n[表格: Metallic Ancestry]\n**Breath Weapon**：When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in a 15-foot cone. Each creature in that area must make a Dexterity saving throw (DC = 8 + your Constitution modifier + your proficiency bonus). On a failed save, the creature takes 1d10 damage of the type associated with your Metallic Ancestry. On a successful save, it takes half as much damage. This damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).\nYou can use your Breath Weapon a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n**Draconic Resistance**：You have resistance to the damage type associated with your Metallic Ancestry.\n**Metallic Breath Weapon**：At 5th level, you gain a second breath weapon. When you take the Attack action on your turn, you can replace one of your attacks with an exhalation in a 15-foot cone. The save DC for this breath is 8 + your Constitution modifier + your proficiency bonus. Whenever you use this trait, choose one:\n• {'type': 'item', 'name': 'Enervating Breath', 'entries': ['Each creature in the cone must succeed on a Constitution saving throw or become {@condition incapacitated} until the start of your next turn.']}\n• {'type': 'item', 'name': 'Repulsion Breath', 'entries': ['Each creature in the cone must succeed on a Strength saving throw or be pushed 20 feet away from you and be knocked {@condition prone}.']}\nOnce you use your Metallic Breath Weapon, you can't do so again until you finish a long rest."
  },
  {
    "name": "Duergar",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are a Humanoid. You are also considered a dwarf for any prerequisite or effect that requires you to be a dwarf.\n**Darkvision**：You can see in dim light within 120 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Duergar Magic**：Starting at 3rd level, you can cast the enlarge/reduce spell on yourself with this trait, without requiring a material component. Starting at 5th level, you can also cast the invisibility spell on yourself with this trait, without requiring a material component. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using spell slots you have of the appropriate level.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race).\n**Dwarven Resilience**：You have advantage on saving throws you make to avoid or end the poisoned condition on yourself. You also have resistance to poison damage.\n**Psionic Fortitude**：You have advantage on saving throws you make to avoid or end the charmed or stunned condition on yourself."
  },
  {
    "name": "Dwarf",
    "source": "PHB",
    "size": [
      "M"
    ],
    "speed": 25,
    "ability": [
      {
        "con": 2
      }
    ],
    "entries": "**Age**：Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years.\n**Size**：Dwarves stand between 4 and 5 feet tall and average about 150 pounds. Your size is Medium.\n**Speed**：Your speed is not reduced by wearing heavy armor.\n**Darkvision**：Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Dwarven Resilience**：You have advantage on saving throws against poison, and you have resistance against poison damage.\n**Dwarven Combat Training**：You have proficiency with the battleaxe, handaxe, light hammer, and warhammer.\n**Tool Proficiency**：You gain proficiency with the artisan's tools of your choice: Smith's tools, brewer's supplies, or mason's tools.\n**Stonecunning**：Whenever you make an Intelligence (History) check related to the origin of stonework, you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.\n**Languages**：You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
  },
  {
    "name": "Dwarf",
    "source": "XPHB",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Darkvision**：You have Darkvision with a range of 120 feet.\n**Dwarven Resilience**：You have Resistance to Poison damage. You also have Advantage on saving throws you make to avoid or end the Poisoned condition.\n**Dwarven Toughness**：Your Hit Points maximum increases by 1, and it increases by 1 again whenever you gain a level.\n**Stonecunning**：As a Bonus Action, you gain Tremorsense with a range of 60 feet for 10 minutes. You must be on a stone surface or touching a stone surface to use this Tremorsense. The stone can be natural or worked.\nYou can use this Bonus Action a number of times equal to your Proficiency, and you regain all expended uses when you finish a Long Rest."
  },
  {
    "name": "Dwarf (Kaladesh)",
    "source": "PSK",
    "size": [
      "M"
    ],
    "speed": 25,
    "ability": [
      {
        "con": 2,
        "wis": 1
      }
    ],
    "entries": "**Age**：Dwarves mature at the same rate as humans, but they're considered young until they reach the age of 50. On average, they live about 350 years.\n**Alignment**：Most dwarves are lawful, believing firmly in the benefits of a well-ordered society. They tend toward good as well, with a strong sense of fair play and a belief that everyone deserves to share in the benefits of a just order.\n**Size**：Dwarves stand around 5 feet tall and average about 150 pounds. Your size is Medium.\n**Speed**：Your base walking speed is 25 feet. Your speed is not reduced by wearing heavy armor.\n**Darkvision**：Accustomed to life underground in your race's ancient past, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Dwarven Resilience**：You have advantage on saving throws against poison, and you have resistance against poison damage.\n**Dwarven Toughness**：Your hit point maximum increases by 1, and it increases by 1 every time you gain a level.\n**Artisan's Expertise**：You gain proficiency with two kinds of artisan's tools of your choice. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies. In addition, whenever you make an Intelligence (History) check related to the origin of any architectural construction (including buildings, public works such as canals and aqueducts, and the massive cogwork that underlies much of the construction of Ghirapur), you are considered proficient in the History skill and add double your proficiency bonus to the check, instead of your normal proficiency bonus.\n**Languages**：You can speak, read, and write Common and Dwarvish. Dwarvish is full of hard consonants and guttural sounds, and those characteristics spill over into whatever other language a dwarf might speak."
  },
  {
    "name": "Eladrin",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "Choose your eladrin's season: autumn, winter, spring, or summer. When finishing a long rest, you can change your season. See the \"Info\" tab for more information.\n**Creature Type**：You are a Humanoid. You are also considered an elf for any prerequisite or effect that requires you to be an elf.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Fey Ancestry**：You have advantage on saving throws you make to avoid or end the charmed condition on yourself.\n**Fey Step**：As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\nWhen you reach 3rd level, your Fey Step gain an additional effect based on your season; if the effect requires a saving throw, the DC equals 8 + your proficiency bonus + your Intelligence, Wisdom, or Charisma modifier (choose when you select this race):\n• {'type': 'item', 'name': 'Autumn', 'entry': 'Immediately after you use your Fey Step, up to two creatures of your choice that you can see within 10 feet of you must succeed on a Wisdom saving throw or be {@condition charmed} by you for 1 minute, or until you or your companions deal any damage to the creatures.'}\n• {'type': 'item', 'name': 'Winter', 'entry': 'When you use your Fey Step, one creature of your choice that you can see within 5 feet of you before you teleport must succeed on a Wisdom saving throw or be {@condition frightened} of you until the end of your next turn.'}\n• {'type': 'item', 'name': 'Spring', 'entry': 'When you use your Fey Step, you can touch one willing creature within 5 feet of you. That creature then teleports instead of you, appearing in an unoccupied space of your choice that you can see within 30 feet of you.'}\n• {'type': 'item', 'name': 'Summer', 'entry': 'Immediately after you use your Fey Step, each creature of your choice that you can see within 5 feet of you takes fire damage equal to your proficiency bonus.'}\n**Keen Senses**：You have proficiency in the Perception skill.\n**Trance**：You don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness.\nWhenever you finish this trance, you can change your season, and you can gain two proficiencies that you don't have, each one with a weapon or a tool of your choice selected from the Player's Handbook. You mystically acquire these proficiencies by drawing them from shared elven memory, and you retain them until you finish your next long rest."
  },
  {
    "name": "Elf",
    "source": "LFL",
    "size": [],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Elf",
    "source": "PHB",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "dex": 2
      }
    ],
    "entries": "**Age**：Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.\n**Size**：Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium.\n**Darkvision**：Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Keen Senses**：You have proficiency in the Perception skill.\n**Fey Ancestry**：You have advantage on saving throws against being charmed, and magic can't put you to sleep.\n**Trance**：Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.\nIf you meditate during a long rest, you finish the rest after only 4 hours. You otherwise obey all the rules for a long rest; only the duration is changed.\n**Languages**：You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
  },
  {
    "name": "Elf",
    "source": "XPHB",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Darkvision**：You have Darkvision with a range of 60 feet.\n**Elven Lineage**：You are part of a lineage that grants you supernatural abilities. Choose a lineage from the Elven Lineages table. You gain the level 1 benefit of that lineage.\nWhen you reach character levels 3 and 5, you learn a higher-level spell, as shown on the table. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have of the appropriate level.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the lineage).\n[表格: Elven Lineages]\n**Fey Ancestry**：You have Advantage on saving throws you make to avoid or end the Charmed condition.\n**Keen Senses**：You have proficiency in the Insight, Perception, or Survival skill.\n**Trance**：You don't need to sleep, and magic can't put you to sleep. You can finish a Long Rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness."
  },
  {
    "name": "Elf (Kaladesh)",
    "source": "PSK",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "dex": 2,
        "wis": 1
      }
    ],
    "entries": "**Age**：Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.\n**Alignment**：Elves love freedom, variety, and self-expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others' freedom as well as their own, and they are more often good than not.\n**Size**：Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium.\n**Darkvision**：Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Keen Senses**：You have proficiency in the Perception skill.\n**Elf Weapon Training**：You have proficiency with the longsword, shortsword, shortbow, and longbow.\n**Fey Ancestry**：You have advantage on saving throws against being charmed, and magic can't put you to sleep.\n**Trance**：Elves don't need to sleep. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you can dream after a fashion; such dreams are actually mental exercises that have become reflexive through years of practice. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.\nIf you meditate during a long rest, you finish the rest after only 4 hours. You otherwise obey all the rules for a long rest; only the duration is changed.\n**Languages**：You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires.\n**Elf Culture**：The elves of Kaladesh don't organize themselves into nations or tribes. Still, they recognize three distinct cultural groups among their kind—though in truth these groupings are more like attitudes or alignments with regard to the rest of society and the use of technology. Choose one of these cultures."
  },
  {
    "name": "Elf (Zendikar)",
    "source": "PSZ",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "wis": 2
      }
    ],
    "entries": "**Age**：Although elves reach physical maturity at about the same age as humans, the elven understanding of adulthood goes beyond physical growth to encompass worldly experience. An elf typically claims adulthood and an adult name around the age of 100 and can live to be 750 years old.\n**Alignment**：Elves love freedom, variety, and self-expression, so they lean strongly toward the gentler aspects of chaos. They value and protect others' freedom as well as their own, and they are more often good than not.\n**Size**：Elves range from under 5 to over 6 feet tall and have slender builds. Your size is Medium.\n**Darkvision**：Accustomed to twilit forests and the night sky, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Keen Senses**：You have proficiency in the Perception skill.\n**Fey Ancestry**：You have advantage on saving throws against being charmed, and magic can't put you to sleep.\n**Languages**：You can speak, read, and write Common and Elvish. Elvish is fluid, with subtle intonations and intricate grammar. Elven literature is rich and varied, and their songs and poems are famous among other races. Many bards learn their language so they can add Elvish ballads to their repertoires."
  },
  {
    "name": "Faerie",
    "source": "LFL",
    "size": [],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Fairy",
    "source": "MPMM",
    "size": [
      "S"
    ],
    "speed": {
      "walk": 30,
      "fly": true
    },
    "ability": {},
    "entries": "**Creature Type**：You are a Fey.\n**Fairy Magic**：You know the druidcraft cantrip. Starting at 3rd level, you can cast the faerie fire spell with this trait. Starting at 5th level, you can also cast the enlarge/reduce spell with this trait. Once you cast faerie fire or enlarge/reduce with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race).\n**Flight**：Because of your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor."
  },
  {
    "name": "Fairy",
    "source": "WBtW",
    "size": [
      "S"
    ],
    "speed": {
      "walk": 30,
      "fly": true
    },
    "ability": {},
    "entries": "**Creature Type**：You are a Fey.\n**Flight**：Because of your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor.\n**Fairy Magic**：You know the druidcraft cantrip.\nStarting at 3rd level, you can cast the faerie fire spell with this trait. Starting at 5th level, you can also cast the enlarge/reduce spell with this trait. Once you cast faerie fire or enlarge/reduce with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
  },
  {
    "name": "Firbolg",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Firbolg Magic**：You can cast detect magic and disguise self spells with this trait. When you use this version of disguise self, you can seem up to 3 feet shorter or taller. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using any spell slots you have.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race).\n**Hidden Step**：As a bonus action, you can magically turn invisible until the start of your next turn or until you attack, make a damage roll, or force someone to make a saving throw. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n**Powerful Build**：You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.\n**Speech of Beast and Leaf**：You have the ability to communicate in a limited manner with Beasts, Plants, and vegetation. They can understand the meaning of your words, though you have no special ability to understand them in return. You have advantage on all Charisma checks you make to influence them."
  },
  {
    "name": "Firbolg",
    "source": "VGM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "wis": 2,
        "str": 1
      }
    ],
    "entries": "**Age**：As humanoids related to the fey, firbolg have long lifespans. A firbolg reaches adulthood around 30, and the oldest of them can live for 500 years.\n**Size**：Firbolg are between 7 and 8 feet tall and weigh between 240 and 300 pounds. Your size is Medium.\n**Firbolg Magic**：You can cast detect magic and disguise self with this trait, using Wisdom as your spellcasting ability for them. Once you cast either spell, you can't cast it again with this trait until you finish a short or long rest. When you use this version of disguise self, you can seem up to 3 feet shorter than normal, allowing you to more easily blend in with humans and elves.\n**Hidden Step**：As a bonus action, you can magically turn invisible until the start of your next turn or until you attack, make a damage roll, or force someone to make a saving throw. Once you use this trait, you can't use it again until you finish a short or long rest.\n**Powerful Build**：You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.\n**Speech of Beast and Leaf**：You have the ability to communicate in a limited manner with beasts and plants. They can understand the meaning of your words, though you have no special ability to understand them in return. You have advantage on all Charisma checks you make to influence them.\n**Languages**：You can speak, read, and write Common, Elvish, and Giant."
  },
  {
    "name": "Flamekin",
    "source": "LFL",
    "size": [],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Genasi",
    "source": "EEPC",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "con": 2
      }
    ],
    "entries": "**Age**：Genasi mature at about the same rate as humans and reach adulthood in their late teens. They live somewhat longer than humans do, up to 120 years.\n**Alignment**：Independent and self-reliant, genasi tend toward a neutral alignment.\n**Size**：Genasi are as varied as their mortal parents but are generally built like humans, standing anywhere from 5 feet to over 6 feet tall. Your size is Medium.\n**Languages**：You can speak, read, and write Common and Primordial. Primordial is a guttural language, filled with harsh syllables and hard consonants."
  },
  {
    "name": "Genasi",
    "source": "MPMM",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Size**：You are Medium or Small. You choose the size when you select this race.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
  },
  {
    "name": "Giff",
    "source": "AAG",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "swim": true
    },
    "ability": {},
    "entries": "**Astral Spark**：Your psychic connection to the Astral Plane enables you to mystically access a spark of divine power, which you can channel through your weapons. When you hit a target with a simple or martial weapon, you can cause the target to take extra force damage equal to your proficiency bonus.\nYou can use this trait a number of times equal to your proficiency bonus, but you can use it no more than once per turn. You regain all expended uses when you finish a long rest.\n**Firearms Mastery**：You have a mystical connection to firearms that traces back to the gods of the giff, who delighted in such weapons. You have proficiency with all firearms and ignore the LD property of any firearm. In addition, attacking at long range with a firearm doesn't impose disadvantage on your attack roll.\n**Hippo Build**：You have advantage on Strength-based ability checks and Strength saving throws. In addition, you count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift."
  },
  {
    "name": "Gith",
    "source": "MTF",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "int": 1
      }
    ],
    "entries": "**Age**：Gith reach adulthood in their late teens and live for about a century.\n**Size**：Gith are taller and leaner than humans, with most a slender 6 feet in height.\n**Languages**：You can speak, read, and write Common and Gith."
  },
  {
    "name": "Githyanki",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Astral Knowledge**：You can mystically access a reservoir of experiences of entities connected to the Astral Plane. Whenever you finish a long rest, you gain proficiency in one skill of your choice and with one weapon or tool of your choice, selected from the Player's Handbook, as you momentarily project your consciousness into the Astral Plane. These proficiencies last until the end of your next long rest.\n**Githyanki Psionics**：You know the mage hand cantrip, and the hand is invisible when you cast the cantrip with this trait.\nStarting at 3rd level, you can cast the jump spell with this trait. Starting at 5th level, you can also cast misty step with it. Once you cast jump or misty step with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race). None of these spells require spell components when you cast them with this trait.\n**Psychic Resilience**：You have resistance to psychic damage."
  },
  {
    "name": "Githzerai",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Githzerai Psionics**：You know the mage hand cantrip, and the hand is invisible when you cast the cantrip with this trait.\nStarting at 3rd level, you can cast the shield spell with this trait. Starting at 5th level, you can also cast the detect thoughts spell with it. Once you cast shield or detect thoughts spell with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast either of those spells using any spell slots you have of the appropriate level.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race). None of these spells require spell components when you cast them with this trait.\n**Mental Discipline**：Your innate psychic defenses grant you advantage on saving throws you make to avoid or end the charmed and frightened conditions on yourself.\n**Psychic Resilience**：You have resistance to psychic damage."
  },
  {
    "name": "Gnoll",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "int": -2
      }
    ],
    "entries": "**Bite**：Your fanged maw is a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Rampage**：When you reduce a creature to 0 hit points with a melee attack on your turn, you can take a bonus action to move up to half your speed and make a bite attack."
  },
  {
    "name": "Gnome",
    "source": "PHB",
    "size": [
      "S"
    ],
    "speed": 25,
    "ability": [
      {
        "int": 2
      }
    ],
    "entries": "**Age**：Gnomes mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years.\n**Size**：Gnomes are between 3 and 4 feet tall and average about 40 pounds. Your size is Small.\n**Darkvision**：Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Gnome Cunning**：You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.\n**Languages**：You can speak, read, and write Common and Gnomish. The Gnomish language, which uses the Dwarvish script, is renowned for its technical treatises and its catalogs of knowledge about the natural world."
  },
  {
    "name": "Gnome",
    "source": "XPHB",
    "size": [
      "S"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Darkvision**：You have Darkvision with a range of 60 feet.\n**Gnomish Cunning**：You have Advantage on Intelligence, Wisdom, and Charisma saving throws.\n**Gnomish Lineage**：You are part of a lineage that grants you supernatural abilities. Choose one of the following options; whichever one you choose, Intelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the lineage):\n• {'type': 'item', 'name': 'Forest Gnome', 'entries': ['You know the {@spell Minor Illusion|XPHB} cantrip. You also always have the {@spell Speak with Animals|XPHB} spell prepared. You can cast it without a spell slot a number of times equal to your {@variantrule Proficiency|XPHB|Proficiency Bonus}, and you regain all expended uses when you finish a {@variantrule Long Rest|XPHB}. You can also use any spell slots you have to cast the spell.']}\n• {'type': 'item', 'name': 'Rock Gnome', 'entries': [\"You know the {@spell Mending|XPHB} and {@spell Prestidigitation|XPHB} cantrips. In addition, you can spend 10 minutes casting {@spell Prestidigitation|XPHB} to create a Tiny clockwork device (AC 5, 1 HP), such as a toy, fire starter, or music box. When you create the device, you determine its function by choosing one effect from {@spell Prestidigitation|XPHB}; the device produces that effect whenever you or another creature takes a {@variantrule Bonus Action|XPHB} to activate it with a touch. If the chosen effect has options within it, you choose one of those options for the device when you create it. For example, if you choose the spell's ignite-extinguish effect, you determine whether the device ignites or extinguishes fire; the device doesn't do both. You can have three such devices in existence at a time, and each falls apart 8 hours after its creation or when you dismantle it with a touch as a {@action Utilize|XPHB} action.\"]}"
  },
  {
    "name": "Gnome (Deep)",
    "source": "DMG",
    "size": [
      "S"
    ],
    "speed": 20,
    "ability": [
      {
        "str": 1,
        "dex": 2
      }
    ],
    "entries": "**Innate Spellcasting**：You have an innate ability to cast the following spells, requiring no material components:\n• {'type': 'itemSpell', 'name': 'At will:', 'entry': '{@spell nondetection} (self only)'}\n• {'type': 'itemSpell', 'name': '1/day each:', 'entry': '{@spell blindness/deafness}, {@spell blur}, {@spell disguise self}'}\nIntelligence is your spellcasting ability for these spells.\n**Stone Camouflage**：You have advantage on Dexterity (Stealth) checks to hide in rocky terrain.\n**Gnome Cunning**：You have advantage on Intelligence, Wisdom, and Charisma saving throws against magic.\n**Superior Darkvision**：Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can speak, read, and write Gnomish, Terran, and Undercommon."
  },
  {
    "name": "Goblin",
    "source": "DMG",
    "size": [
      "S"
    ],
    "speed": 30,
    "ability": [
      {
        "str": -2,
        "dex": 2
      }
    ],
    "entries": "**Nimble Escape**：You can take the Disengage or Hide action as a bonus action on each of your turns.\n**Darkvision**：Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can speak, read, and write Common and Goblin."
  },
  {
    "name": "Goblin",
    "source": "ERLW",
    "size": [
      "S"
    ],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Goblin",
    "source": "GGR",
    "size": [],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Goblin",
    "source": "MPMM",
    "size": [
      "S"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are a Humanoid. You are also considered a goblinoid for any prerequisite or effect that requires you to be a goblinoid.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were in dim light. You discern colors in that darkness only as shades of gray.\n**Fey Ancestry**：You have advantage on saving throws you make to avoid or end the charmed condition on yourself.\n**Fury of the Small**：When you damage a creature with an attack or a spell and the creature's size is larger than yours, you can cause the attack or spell to deal extra damage to the creature. The extra damage equals your proficiency bonus.\nYou can use this trait a number of times equal to your proficiency bonus, regaining all expended uses when you finish a long rest, and you can use it no more than once per turn.\n**Nimble Escape**：You can take the Disengage or Hide action as a bonus action on each of your turns."
  },
  {
    "name": "Goblin",
    "source": "PSZ",
    "size": [
      "S"
    ],
    "speed": 25,
    "ability": {},
    "entries": "**Age**：Goblins mature faster than humans, reaching adulthood at around age 12. They also age noticeably faster than humans, and even the most cautious goblins rarely live longer than 50 years.\n**Alignment**：Most goblins are wildly chaotic, though they have no particular inclination toward good or evil.\n**Size**：Goblins average about 3 feet tall and weigh about 40 pounds. Your size is Small.\n**Darkvision**：Thanks to your heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can speak, read, and write Common and Goblin.\n**Grit**：You have resistance to fire damage and psychic damage. In addition, when you are wearing no armor, your AC is equal to 11 + your Dexterity modifier."
  },
  {
    "name": "Goblin",
    "source": "VGM",
    "size": [
      "S"
    ],
    "speed": 30,
    "ability": [
      {
        "dex": 2,
        "con": 1
      }
    ],
    "entries": "**Age**：Goblins reach adulthood at age 8 and live up to 60 years.\n**Size**：Goblins are between 3 and 4 feet tall and weigh between 40 and 80 pounds. Your size is Small.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Fury of the Small**：When you damage a creature with an attack or a spell and the creature's size is larger than yours, you can cause the attack or spell to deal extra damage to the creature. The extra damage equals your level. Once you use this trait, you can't use it again until you finish a short or long rest.\n**Nimble Escape**：You can take the Disengage or Hide action as a bonus action on each of your turns.\n**Languages**：You can speak, read, and write Common and Goblin."
  },
  {
    "name": "Goblin (Dankwood)",
    "source": "AWM",
    "size": [],
    "speed": {},
    "ability": [
      {
        "dex": 2,
        "wis": 1
      }
    ],
    "entries": ""
  },
  {
    "name": "Goliath",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Little Giant**：You have proficiency in the Athletics skill, and you count as one size larger when determining your carrying weight and the weight you can push, drag, or lift.\n**Mountain Born**：You have resistance to cold damage. You also naturally acclimate to high altitudes, even if you've never been to one. This includes elevations above 20,000 feet.\n**Stone's Endurance**：You can supernaturally draw on unyielding stone to shrug off harm. When you take damage, you can use your reaction to roll a d12. Add your Constitution modifier to the number rolled and reduce the damage by that total.\nYou can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
  },
  {
    "name": "Goliath",
    "source": "VGM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "con": 1
      }
    ],
    "entries": "**Age**：Goliaths have lifespans comparable to humans. They enter adulthood in their late teens and usually live less than a century.\n**Size**：Goliaths are between 7 and 8 feet tall and weigh between 280 and 340 pounds. Your size is Medium.\n**Natural Athlete**：You have proficiency in the Athletics skill.\n**Stone's Endurance**：You can focus yourself to occasionally shrug off injury. When you take damage, you can use your reaction to roll a d12. Add your Constitution modifier to the number rolled, and reduce the damage by that total. After you use this trait, you can't use it again until you finish a short or long rest.\n**Powerful Build**：You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.\n**Mountain Born**：You have resistance to cold damage. You're also acclimated to high altitude, including elevations above 20,000 feet.\n**Languages**：You can speak, read, and write Common and Giant."
  },
  {
    "name": "Goliath",
    "source": "XPHB",
    "size": [
      "M"
    ],
    "speed": 35,
    "ability": {},
    "entries": "**Giant Ancestry**：You are descended from Giants. Choose one of the following benefits—a supernatural boon from your ancestry; you can use the chosen benefit a number of times equal to your Proficiency, and you regain all expended uses when you finish a Long Rest:\n• {'type': 'item', 'name': \"Cloud's Jaunt (Cloud Giant)\", 'entries': ['As a {@variantrule Bonus Action|XPHB}, you magically teleport up to 30 feet to an unoccupied space you can see.']}\n• {'type': 'item', 'name': \"Fire's Burn (Fire Giant)\", 'entries': ['When you hit a target with an attack roll and deal damage to it, you can also deal {@damage 1d10} Fire damage to that target.']}\n• {'type': 'item', 'name': \"Frost's Chill (Frost Giant)\", 'entries': ['When you hit a target with an attack roll and deal damage to it, you can also deal {@damage 1d6} Cold damage to that target and reduce its {@variantrule Speed|XPHB} by 10 feet until the start of your next turn.']}\n• {'type': 'item', 'name': \"Hill's Tumble (Hill Giant)\", 'entries': ['When you hit a Large or smaller creature with an attack roll and deal damage to it, you can give that target the {@condition Prone|XPHB} condition.']}\n• {'type': 'item', 'name': \"Stone's Endurance (Stone Giant)\", 'entries': ['When you take damage, you can take a {@variantrule Reaction|XPHB} to roll {@dice 1d12}. Add your Constitution modifier to the number rolled and reduce the damage by that total.']}\n• {'type': 'item', 'name': \"Storm's Thunder (Storm Giant)\", 'entries': ['When you take damage from a creature within 60 feet of you, you can take a {@variantrule Reaction|XPHB} to deal {@damage 1d8} Thunder damage to that creature.']}\n**Large Form**：Starting at character level 5, you can change your size to Large as a Bonus Action if you're in a big enough space. This transformation lasts for 10 minutes or until you end it (no action required). For that duration, you have Advantage on Strength checks, and your Speed increases by 10 feet. Once you use this trait, you can't use it again until you finish a Long Rest.\n**Powerful Build**：You have Advantage on any ability check you make to end the Grappled condition. You also count as one size larger when determining your carrying capacity."
  },
  {
    "name": "Grimlock",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "cha": -2
      }
    ],
    "entries": "**Blindsight**：You have no eyes, and cannot be blinded. You can perceive your surroundings within 30 ft., or 10 ft. while deafened. You are considered blind beyond this radius.\n**Keen Hearing and Smell**：You have advantage on Wisdom (Perception) checks that rely on hearing or smell.\n**Stone Camouflage**：You have advantage on Dexterity (Stealth) checks made to hide in rocky terrain.\n**Languages**：You can speak, read, and write Undercommon."
  },
  {
    "name": "Grung",
    "source": "OGA",
    "size": [
      "S"
    ],
    "speed": {
      "walk": 25,
      "climb": 25
    },
    "ability": [
      {
        "dex": 2,
        "con": 1
      }
    ],
    "entries": "**Age**：Grungs mature to adulthood in a single year, but have been known to live up to 50 years.\n**Alignment**：Most grungs are lawful, having been raised in a strict caste system. They tend toward evil as well, coming from a culture where social advancement occurs rarely, and most often because another member of your army has died and there is no one else of that caste to fill the vacancy.\n**Size**：Grungs stand between 2½ and 3½ feet tall and average about 30 pounds. Your size is Small.\n**Arboreal Alertness**：You have proficiency in the Perception skill.\n**Amphibious**：You can breathe air and water.\n**Poison Immunity**：You're immune to poison damage and the poisoned condition.\n**Poisonous Skin**：Any creature that grapples you or otherwise comes into direct contact with your skin must succeed on a 12 Constitution saving throw or become poisoned for 1 minute. A poisoned creature no longer in direct contact with you can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success.\nYou can also apply this poison to any piercing weapon as part of an attack with that weapon, though when you hit the poison reacts differently. The target must succeed on a 12 Constitution saving throw or take 2d4 poison damage.\n**Standing Leap**：Your long jump is up to 25 feet and your high jump is up to 15 feet, with or without a running start.\n**Water Dependency**：If you fail to immerse yourself in water for at least 1 hour during a day, you suffer one level of exhaustion at the end of that day. You can only recover from this exhaustion through magic or by immersing yourself in water for at least 1 hour.\n**Languages**：You can speak, read, and write Grung."
  },
  {
    "name": "Hadozee",
    "source": "AAG",
    "size": [
      "S",
      "M"
    ],
    "speed": {
      "walk": 30,
      "climb": true
    },
    "ability": {},
    "entries": "**Size**：You are Medium or Small. You choose the size when you select this race.\n**Dexterous Feet**：As a bonus action, you can use your feet to manipulate an object, open or close a door or container, or pick up or set down a Tiny object.\n**Glide**：When you fall at least 10 feet above the ground, you can use your reaction to extend your skin membranes to glide horizontally a number of feet equal to your walking speed, and you take 0 damage from the fall. You determine the direction of the glide.\n**Hadozee Dodge**：The magic that runs in your veins heightens your natural defenses. When you take damage, you can use your reaction to roll a d6. Add your proficiency bonus to the number rolled, and reduce the damage you take by an amount equal to that total (minimum of 0 damage).\nYou can use this trait a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest."
  },
  {
    "name": "Half-Elf",
    "source": "PHB",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "cha": 2,
        "choose": {
          "from": [
            "str",
            "dex",
            "con",
            "int",
            "wis"
          ],
          "count": 2
        }
      }
    ],
    "entries": "**Age**：Half-elves mature at the same rate humans do and reach adulthood around the age of 20. They live much longer than humans, however, often exceeding 180 years.\n**Size**：Half-elves are about the same size as humans, ranging from 5 to 6 feet tall. Your size is Medium.\n**Darkvision**：Thanks to your elf blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Fey Ancestry**：You have advantage on saving throws against being charmed, and magic can't put you to sleep.\n**Skill Versatility**：You gain proficiency in two skills of your choice.\n**Languages**：You can speak, read, and write Common, Elvish, and one extra language of your choice."
  },
  {
    "name": "Half-Orc",
    "source": "PHB",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "con": 1
      }
    ],
    "entries": "**Age**：Half-orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.\n**Size**：Half-orcs are somewhat larger and bulkier than humans, and they range from 5 to well over 6 feet tall. Your size is Medium.\n**Darkvision**：Thanks to your orc blood, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Menacing**：You gain proficiency in the Intimidation skill.\n**Relentless Endurance**：When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest.\n**Savage Attacks**：When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit.\n**Languages**：You can speak, read, and write Common and Orc. Orc is a harsh, grating language with hard consonants. It has no script of its own but is written in the Dwarvish script."
  },
  {
    "name": "Halfling",
    "source": "PHB",
    "size": [
      "S"
    ],
    "speed": 25,
    "ability": [
      {
        "dex": 2
      }
    ],
    "entries": "**Age**：A halfling reaches adulthood at the age of 20 and generally lives into the middle of his or her second century.\n**Size**：Halflings average about 3 feet tall and weigh about 40 pounds. Your size is Small.\n**Lucky**：When you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll.\n**Brave**：You have advantage on saving throws against being frightened.\n**Halfling Nimbleness**：You can move through the space of any creature that is of a size larger than yours.\n**Languages**：You can speak, read, and write Common and Halfling. The Halfling language isn't secret, but halflings are loath to share it with others. They write very little, so they don't have a rich body of literature. Their oral tradition, however, is very strong. Almost all halflings speak Common to converse with the people in whose lands they dwell or through which they are traveling."
  },
  {
    "name": "Halfling",
    "source": "XPHB",
    "size": [
      "S"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Brave**：You have Advantage on saving throws you make to avoid or end the Frightened condition.\n**Halfling Nimbleness**：You can move through the space of any creature that is a size larger than you, but you can't stop in the same space.\n**Luck**：When you roll a 1 on the d20 of a D20 Test, you can reroll the die, and you must use the new roll.\n**Naturally Stealthy**：You can take the Hide action even when you are obscured only by a creature that is at least one size larger than you."
  },
  {
    "name": "Harengon",
    "source": "MPMM",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Size**：You are Medium or Small. You choose the size when you select this race.\n**Hare-Trigger**：You can add your proficiency bonus to your initiative rolls.\n**Leporine Senses**：You have proficiency in the Perception skill.\n**Lucky Footwork**：When you fail a Dexterity saving throw, you can use your reaction to roll a d4 and add it to the save, potentially turning the failure into a success. You can't use this reaction if you're prone or your speed is 0.\n**Rabbit Hop**：As a bonus action, you can jump a number of feet equal to five times your proficiency bonus, without provoking opportunity attacks. You can use this trait only if your speed is greater than 0. You can use it a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
  },
  {
    "name": "Harengon",
    "source": "WBtW",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Size**：You are Medium or Small. You choose the size when you select this race.\n**Hare-Trigger**：You can add your proficiency bonus to your initiative rolls.\n**Leporine Senses**：You have proficiency in the Perception skill.\n**Lucky Footwork**：When you fail a Dexterity saving throw, you can use your reaction to roll a d4 and add it to the save, potentially turning the failure into a success. You can't use this reaction if you're prone or your speed is 0.\n**Rabbit Hop**：As a bonus action, you can jump a number of feet equal to five times your proficiency bonus, without provoking opportunity attacks. You can use this trait only if your speed is greater than 0. You can use it a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
  },
  {
    "name": "Hexblood",
    "source": "VRGR",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are a Fey.\n**Size**：You are Medium or Small. You choose the size when you gain this lineage.\n**Ancestral Legacy**：If you replace a race with this lineage, you can keep the following elements of that race: any skill proficiencies you gained from it and any climbing, flying, or swimming speed you gained from it.\nIf you don't keep any of those elements or you choose this lineage at character creation, you gain proficiency in two skills of your choice.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness as shades of gray.\n**Eerie Token**：As a bonus action, you can harmlessly remove a lock of your hair, one of your nails, or one of your teeth. This token is imbued with magic until you finish a long rest. While the token is imbued in this way, you can take these actions:\n• {'type': 'item', 'name': 'Telepathic Message', 'entry': 'As an action, you can send a telepathic message to the creature holding or carrying the token, as long as you are within 10 miles of it. The message can contain up to twenty-five words.'}\n• {'type': 'item', 'name': 'Remote Viewing', 'entry': \"If you are within 10 miles of the token, you can enter a trance as an action. The trance lasts for 1 minute, but it ends early if you dismiss it (no action required) or are {@condition incapacitated}. During this trance, you can see and hear from the token as if you were located where it is. While you are using your senses at the token's location, you are {@condition blinded} and {@condition deafened} in regard to your own surroundings. When the trance ends, the token is harmlessly destroyed.\"}\nOnce you create a token using this feature, you can't do so again until you finish a long rest, at which point your missing part regrows.\n**Hex Magic**：You can cast the disguise self and hex spells with this trait. Once you cast either of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using any spell slots you have.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose the ability when you gain this lineage).\nHags can undertake a ritual to irreversibly transform a hexblood they created into a new hag, either one of their own kind or that embodies the hexblood's nature. This requires that both the hag and hexblood be in the same place and consent to the lengthy ritual—circumstances most hexbloods shun but might come to accept over the course of centuries. Once a hexblood undergoes this irreversible ritual, they emerge as a hag NPC no longer under the control of the hexblood's player, unless the DM rules otherwise."
  },
  {
    "name": "Hobgoblin",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Martial Advantage**：Once per turn, you can deal an extra 2d6 damage to a creature you hit with a weapon attack if that creature is within 5 ft. of an ally of yours that isn't incapacitated.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can speak, read, and write Common and Goblin."
  },
  {
    "name": "Hobgoblin",
    "source": "ERLW",
    "size": [],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Hobgoblin",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are a Humanoid. You are also considered a goblinoid for any prerequisite or effect that requires you to be a goblinoid.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Fey Ancestry**：You have advantage on saving throws you make to avoid or end the charmed condition on yourself.\n**Fey Gift**：You can use this trait to take the Help action as a bonus action, and you can do so a number of times equal to your proficiency bonus. You regain all expended uses when you finish a long rest.\nStarting at 3rd level, choose one of the options below each time you take the Help action with this trait:\n• {'type': 'item', 'name': 'Hospitality', 'entry': 'You and the creature you help each gain a number of temporary hit points equal to {@dice 1d6} plus your proficiency bonus.'}\n• {'type': 'item', 'name': 'Passage', 'entry': 'You and the creature you help each increase your walking speeds by 10 feet until the start of your next turn.'}\n• {'type': 'item', 'name': 'Spite', 'entry': 'Until the start of your next turn, the first time the creature you help hits a target with an attack roll, that target has disadvantage on the next attack roll it makes within the next minute.'}\n**Fortune from the Many**：If you miss with an attack roll or fail an ability check or a saving throw, you can draw on your bonds of reciprocity to gain a bonus to the roll equal to the number of allies you can see within 30 feet of you (maximum bonus of +3). You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
  },
  {
    "name": "Hobgoblin",
    "source": "VGM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "con": 2,
        "int": 1
      }
    ],
    "entries": "**Age**：Hobgoblins mature at the same rate as humans and have lifespans similar in length to theirs.\n**Size**：Hobgoblins are between 5 and 6 feet tall and weigh between 150 and 200 pounds. Your size is Medium.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Martial Training**：You are proficient with two martial weapons of your choice and with light armor.\n**Saving Face**：Hobgoblins are careful not to show weakness in front of their allies, for fear of losing status. If you miss with an attack roll or fail an ability check or a saving throw, you can gain a bonus to the roll equal to the number of allies you can see within 30 feet of you (maximum bonus of +5). Once you use this trait, you can't use it again until you finish a short or long rest.\n**Languages**：You can speak, read, and write Common and Goblin."
  },
  {
    "name": "Human",
    "source": "PHB",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Age**：Humans reach adulthood in their late teens and live less than a century.\n**Size**：Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.\n**Languages**：You can speak, read, and write Common and one extra language of your choice. Humans typically learn the languages of other peoples they deal with, including obscure dialects. They are fond of sprinkling their speech with words borrowed from other tongues: Orc curses, Elvish musical expressions, Dwarvish military phrases, and so on."
  },
  {
    "name": "Human",
    "source": "XPHB",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Resourceful**：You gain Heroic Inspiration whenever you finish a Long Rest.\n**Skillful**：You gain proficiency in one skill of your choice.\n**Versatile**：You gain an Origin feat of your choice."
  },
  {
    "name": "Human (Amonkhet)",
    "source": "PSA",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "choose": {
          "from": [
            "str",
            "dex",
            "con",
            "int",
            "wis",
            "cha"
          ],
          "count": 2
        }
      }
    ],
    "entries": "**Age**：Humans reach adulthood in their late teens. Most human initiates have completed the trials and found a glorious or inglorious death before they turn 30. Viziers can enjoy longer service to their gods, in theory living up to a century.\n**Alignment**：Humans tend toward no particular alignment. The best and the worst are found among them.\n**Size**：Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium\n**Skills**：You gain proficiency in one skill of your choice.\n**Feat**：You gain one feat of your choice.\n**Languages**：You can speak, read, and write Common and one extra language of your choice."
  },
  {
    "name": "Human (Innistrad)",
    "source": "PSI",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Age**：Humans reach adulthood in their late teens and live less than a century.\n**Alignment**：Humans tend toward no particular alignment.\n**Size**：Humans vary widely in height and build, from barely 5 feet to well over 6 feet tall. Regardless of your position in that range, your size is Medium.\n**Languages**：You can speak, read, and write Common and one extra language of your choice."
  },
  {
    "name": "Human (Ixalan)",
    "source": "PSX",
    "size": [],
    "speed": {},
    "ability": [
      {
        "str": 1,
        "dex": 1,
        "con": 1,
        "int": 1,
        "wis": 1,
        "cha": 1
      }
    ],
    "entries": ""
  },
  {
    "name": "Human (Kaladesh)",
    "source": "PSK",
    "size": [],
    "speed": {},
    "ability": [
      {
        "str": 1,
        "dex": 1,
        "con": 1,
        "int": 1,
        "wis": 1,
        "cha": 1
      }
    ],
    "entries": ""
  },
  {
    "name": "Human (Zendikar)",
    "source": "PSZ",
    "size": [],
    "speed": {},
    "ability": [
      {
        "str": 1,
        "dex": 1,
        "con": 1,
        "int": 1,
        "wis": 1,
        "cha": 1
      }
    ],
    "entries": ""
  },
  {
    "name": "Kalashtar",
    "source": "EFA",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Dual Mind**：You have Advantage on Wisdom and Charisma saving throws.\n**Mental Discipline**：You have Resistance to Psychic damage.\n**Mind Link**：You have telepathy with a range in feet equal to 10 times your level. When you're using this trait to speak telepathically to a creature, you can take a Magic action to give that creature the ability to speak telepathically with you for 1 hour or until you take another Magic action to end this effect.\n**Severed from Dreams**：You can't be the target of the Dream spell. In addition, when you finish a Long Rest, you gain proficiency in one skill of your choice. This proficiency lasts until you finish another Long Rest."
  },
  {
    "name": "Kalashtar",
    "source": "ERLW",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "wis": 2,
        "cha": 1
      }
    ],
    "entries": "**Age**：Kalashtar mature and age at the same rate as humans.\n**Alignment**：The noble spirit tied to a kalashtar drives it toward lawful and good behavior. Most kalashtar combine strong self-discipline with compassion for all beings, but some kalashtar resist the virtuous influence of their spirit.\n**Size**：Your size is Medium.\n**Dual Mind**：You have advantage on all Wisdom saving throws.\n**Mental Discipline**：You have resistance to psychic damage.\n**Mind Link**：You can speak telepathically to any creature you can see, provided the creature is within a number of feet of you equal to 10 times your level. You don't need to share a language with the creature for it to understand your telepathic utterances, but the creature must be able to understand at least one language.\nWhen you're using this trait to speak telepathically to a creature, you can use your action to give that creature the ability to speak telepathically with you for 1 hour or until you end this effect as an action. To use this ability, the creature must be able to see you and must be within this trait's range. You can give this ability to only one creature at a time; giving it to a creature takes it away from another creature who has it.\n**Severed from Dreams**：Kalashtar sleep, but they don't connect to the plane of dreams as other creatures do. Instead, their minds draw from the memories of their otherworldly spirit while they sleep. As such, you are immune to spells and other magical effects that require you to dream, like dream, but not to spells and other magical effects that put you to sleep, like sleep.\n**Languages**：You can speak, read, and write Common, Quori, and one other language of your choice."
  },
  {
    "name": "Kender",
    "source": "DSotDQ",
    "size": [
      "S"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Fearless**：You have advantage on saving throws you make to avoid or end the frightened condition on yourself. When you fail a saving throw to avoid or end the frightened condition on yourself, you can choose to succeed instead. Once you succeed on a saving throw in this way, you can't do so again until you finish a long rest.\n**Kender Curiosity**：Thanks to the mystical origin of your people, you gain proficiency with one of the following skills of your choice: Insight, Investigation, Sleight of Hand, Stealth, or Survival.\n**Taunt**：You have an extraordinary ability to fluster creatures. As a bonus action, you can unleash a string of provoking words at a creature within 60 feet of yourself that can hear and understand you. The target must succeed on a Wisdom saving throw, or it has disadvantage on attack rolls against targets other than you until the start of your next turn. The DC equals 8 + your proficiency bonus + your Intelligence, Wisdom, or Charisma modifier (choose when you select this race).\nYou can use this bonus action a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
  },
  {
    "name": "Kenku",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "dex": 2
      }
    ],
    "entries": "**Ambusher**：In the first round of a combat, you have advantage on attack rolls against any creature who is surprised.\n**Mimicry**：You can mimic any sounds you have heard, including voices. A creature that hears the sounds can tell they are imitations with a successful 14 Wisdom (Insight) check.\n**Languages**：You can read and write Common and Auran, but you can only speak using your Mimicry trait."
  },
  {
    "name": "Kenku",
    "source": "MPMM",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Size**：Your size is Medium or Small. You choose the size when you select this race.\n**Expert Duplication**：When you copy writing or craftwork produced by yourself or someone else, you have advantage on any ability checks you make to produce an exact duplicate.\n**Kenku Recall**：Thanks to your supernaturally good memory, you have proficiency in two skills of your choice.\nMoreover, when you make an ability check using any skill in which you have proficiency, you can give yourself advantage on the check before rolling the d20. You can give yourself advantage in this way a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n**Mimicry**：You can accurately mimic sounds you have heard, including voices. A creature that hears the sounds you make can tell they are imitations only with a successful Wisdom (Insight) check against a DC of 8 + your proficiency bonus + your Charisma modifier."
  },
  {
    "name": "Kenku",
    "source": "VGM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "dex": 2,
        "wis": 1
      }
    ],
    "entries": "**Age**：Kenku have shorter lifespans than humans. They reach maturity at about 12 years old and can live to 60.\n**Size**：Kenku are around 5 feet tall and weigh between 90 and 120 pounds. Your size is Medium.\n**Expert Forgery**：You can duplicate other creatures' handwriting and craftwork. You have advantage on all checks made to produce forgeries or duplicates of existing objects.\n**Kenku Training**：You are proficient in your choice of two of the following skills: Acrobatics, Deception, Stealth, and Sleight of Hand.\n**Mimicry**：You can mimic sounds you have heard, including voices. A creature that hears the sounds can tell they are imitations with a successful Wisdom (Insight) check opposed by your Charisma (Deception) check.\n**Languages**：You can read and write Common and Auran, but you can only speak using your Mimicry trait."
  },
  {
    "name": "Khenra",
    "source": "PSA",
    "size": [
      "M"
    ],
    "speed": 35,
    "ability": [
      {
        "dex": 2,
        "str": 1
      }
    ],
    "entries": "**Age**：Khenra mature quickly, reaching adulthood in their early teens. Khenra initiates are usually the youngest in a crop, completing the trials by their late teens. Even without a violent death, they rarely live past 60.\n**Alignment**：Most khenra lean toward chaotic alignments. They have no particular inclination toward good or evil.\n**Size**：Khenra have similar builds to humans. Your size is Medium.\n**Khenra Weapon Training**：You have proficiency with the khopesh (longsword), spear, and javelin.\n**Khenra Twins**：If your twin is alive and you can see your twin, whenever you roll a 1 on an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll. If your twin is dead (or if you were born without a twin), you can't be frightened.\n**Languages**：You can speak, read, and write Common and Khenra."
  },
  {
    "name": "Khoravar",
    "source": "EFA",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Darkvision**：You have Darkvision with a range of 60 feet.\n**Fey Ancestry**：You have Advantage on saving throws you make to avoid or end the Charmed condition.\n**Fey Gift**：You know the Friends cantrip. Whenever you finish a Long Rest, you can replace that cantrip with a different cantrip from the Cleric, Druid, or Wizard spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for it (choose the ability when you select this species).\n**Lethargy Resilience**：When you fail a saving throw to avoid or end the Unconscious condition, you can succeed instead. Once you use this trait, you can't do so again until you finish 1d4 Long Rest.\n**Skill Versatility**：You gain proficiency in one skill or with one tool of your choice. Whenever you finish a Long Rest, you can replace it with another skill or tool proficiency."
  },
  {
    "name": "Kithkin",
    "source": "LFL",
    "size": [],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Kobold",
    "source": "DMG",
    "size": [
      "S"
    ],
    "speed": 30,
    "ability": [
      {
        "dex": 2,
        "str": -4
      }
    ],
    "entries": "**Pack Tactics**：You have advantage on an attack roll against a creature if at least one of your allies is within 5 feet of the creature and the ally isn't incapacitated.\n**Sunlight Sensitivity**：You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight.\n**Darkvision**：Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can speak, read, and write Common and Draconic."
  },
  {
    "name": "Kobold",
    "source": "MPMM",
    "size": [
      "S"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were in dim light. You discern colors in that darkness only as shades of gray.\n**Draconic Cry**：As a bonus action, you let out a cry at your enemies within 10 feet of you. Until the start of your next turn, you and your allies have advantage on attack rolls against any of those enemies who could hear you. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n**Kobold Legacy**：Kobold's connections to dragons can manifest in unpredictable ways in an individual kobold. Choose one of the following legacy options for your kobold.\n• {'type': 'item', 'name': 'Craftiness', 'entry': 'You have proficiency in one of the following skills of your choice: {@skill Arcana}, {@skill Investigation}, {@skill Medicine}, {@skill Sleight of Hand}, or {@skill Survival}.'}\n• {'type': 'item', 'name': 'Defiance', 'entry': 'You have advantage on saving throws to avoid or end the {@condition frightened} condition on yourself.'}\n• {'type': 'item', 'name': 'Draconic Sorcery', 'entry': 'You know one {@filter cantrip of your choice from the sorcerer spell list|spells|level=0|class=Sorcerer}. Intelligence, Wisdom, or Charisma is your spellcasting ability for that cantrip (choose when you select this race).'}"
  },
  {
    "name": "Kobold",
    "source": "VGM",
    "size": [
      "S"
    ],
    "speed": 30,
    "ability": [
      {
        "dex": 2
      }
    ],
    "entries": "**Age**：Kobolds reach adulthood at age 6 and can live up to 120 years but rarely do so.\n**Size**：Kobolds are between 2 and 3 feet tall and weigh between 25 and 35 pounds. Your size is Small.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Grovel, Cower, and Beg**：As an action on your turn, you can cower pathetically to distract nearby foes. Until the end of your next turn, your allies gain advantage on attack rolls against enemies within 10 feet of you that you can see. Once you use this trait, you can't use it again until you finish a short or long rest.\n**Pack Tactics**：You have advantage on an attack roll against a creature if at least one of your allies is within 5 feet of the creature and the ally isn't incapacitated.\n**Sunlight Sensitivity**：You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight.\n**Languages**：You can speak, read, and write Common and Draconic."
  },
  {
    "name": "Kor",
    "source": "PSZ",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "climb": 30
    },
    "ability": [
      {
        "dex": 2,
        "wis": 1
      }
    ],
    "entries": "**Age**：Kor mature at the same rate as humans and live about as long.\n**Alignment**：Most kor are lawful good, with a strong dedication to community and the traditions of their ancestors.\n**Size**：Kor average nearly 6 feet tall, but are much lighter and more slender than humans. Your size is Medium.\n**Brave**：You have advantage on saving throws against being frightened.\n**Climbing**：You also have a climbing speed of 30 feet as long as you are not encumbered or wearing heavy armor.\n**Kor Climbing**：You have proficiency in the Athletics and Acrobatics skills.\n**Languages**：You can speak, read, and write Common, and communicate in the silent speech of the Kor.\n**Lucky**：When you roll a 1 on the d20 for an attack roll, ability check, or saving throw, you can reroll the die and must use the new roll."
  },
  {
    "name": "Kuo-Toa",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "swim": 30
    },
    "ability": {},
    "entries": "**Amphibious**：You can breathe air and water.\n**Otherworldly Perception**：You can sense the presence of any creature within 30 feet of you that is invisible or on the Ethereal Plane. You can pinpoint such a creature that is moving.\n**Slippery**：You have advantage on ability checks and saving throws made to escape a grapple.\n**Sunlight Sensitivity**：While in sunlight, you have disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight.\n**Superior Darkvision**：You have superior vision in dark and dim conditions. You can see in dim light within 120 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can speak, read, and write Undercommon."
  },
  {
    "name": "Leonin",
    "source": "MOT",
    "size": [
      "M"
    ],
    "speed": 35,
    "ability": [
      {
        "str": 1,
        "con": 2
      }
    ],
    "entries": "**Age**：Leonin mature and age at about the same rate as humans.\n**Alignment**：Leonin tend toward good alignments. Leonin who are focused on the pride lean toward lawful good.\n**Size**：Leonin are typically over 6 feet tall, with some standing over 7 feet. Your size is Medium.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Claws**：Your claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you can deal slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n**Hunter's Instincts**：You have proficiency in one of the following skills of your choice: Athletics, Intimidation, Perception, or Survival.\n**Daunting Roar**：As a bonus action, you can let out an especially menacing roar. Creatures of your choice within 10 feet of you that can hear you must succeed on a Wisdom saving throw or become frightened of you until the end of your next turn. The DC of the save equals 8 + your proficiency bonus + your Constitution modifier. Once you use this trait, you can't use it again until you finish a short or long rest.\n**Languages**：You can speak, read, and write Common and Leonin."
  },
  {
    "name": "Lizardfolk",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "swim": 30
    },
    "ability": [
      {
        "str": 2,
        "int": -2
      }
    ],
    "entries": "**Hold Breath**：You can hold your breath for up to 15 minutes at a time.\n**Natural Armor**：Your scales function as natural armor, granting you a +3 bonus to Armor Class.\n**Languages**：You can speak, read, and write Draconic."
  },
  {
    "name": "Lizardfolk",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "swim": true
    },
    "ability": {},
    "entries": "**Speed**：Your walking speed is 30 feet, and you have a swimming speed equal to your walking speed.\n**Bite**：You have a fanged maw that you can use to make unarmed strikes. When you hit with it, the strike deals 1d6 + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike.\n**Hold Breath**：You can hold your breath for up to 15 minutes at a time.\n**Hungry Jaws**：You can throw yourself into a feeding frenzy. As a bonus action, you can make a special attack with your Bite. If the attack hits, it deals its normal damage, and you gain temporary hit points equal to your proficiency bonus. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\n**Natural Armor**：You have tough, scaly skin. When you aren't wearing armor, your base AC is 13 + Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor.\n**Nature's Intuition**：Thanks to your mystical connection to nature, you gain proficiency with two of the following skills of your choice: Animal Handling, Medicine, Nature, Perception, Stealth, or Survival."
  },
  {
    "name": "Lizardfolk",
    "source": "VGM",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "swim": 30
    },
    "ability": [
      {
        "con": 2,
        "wis": 1
      }
    ],
    "entries": "**Age**：Lizardfolk reach maturity around age 14 and rarely live longer than 60 years.\n**Size**：Lizardfolk are a little bulkier and taller than humans, and their colorful frills make them appear even larger. Your size is Medium.\n**Swim Speed**：You have a swimming speed of 30 feet.\n**Bite**：Your fanged maw is a natural weapon, which you can use to make unarmed strikes. If you hit with it, you deal piercing damage equal to 1d6 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n**Cunning Artisan**：As part of a short rest, you can harvest bone and hide from a slain beast, construct, dragon, monstrosity, or plant creature of size small or larger to create one of the following items: a shield, a club, a javelin, or 1d4 dart or blowgun needle. To use this trait, you need a blade, such as a dagger, or appropriate artisan's tools, such as leatherworker's tools.\n**Hold Breath**：You can hold your breath for up to 15 minutes at a time.\n**Hunter's Lore**：You gain proficiency with two of the following skills of your choice: Animal Handling, Nature, Perception, Stealth, and Survival.\n**Natural Armor**：You have tough, scaly skin. When you aren't wearing armor, your AC is 13 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor.\n**Hungry Jaws**：In battle, you can throw yourself into a vicious feeding frenzy. As a bonus action, you can make a special attack with your bite. If the attack hits, it deals its normal damage, and you gain temporary hit points equal to your Constitution modifier (minimum of 1), and you can't use this trait again until you finish a short or long rest.\n**Languages**：You can speak, read, and write Common and Draconic."
  },
  {
    "name": "Locathah",
    "source": "LR",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "swim": 30
    },
    "ability": [
      {
        "str": 2,
        "dex": 1
      }
    ],
    "entries": "**Age**：Locathah mature to adulthood by the age of 10 but have been known to live up to 80 years.\n**Alignment**：Most locathah are true neutral or have some aspect of neutrality in their alignment. They tend toward good, coming from a culture where compassion for the downtrodden is a commonality.\n**Natural Armor**：You have tough, scaly skin. When you aren't wearing armor, your AC is 12 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor.\n**Observant & Athletic**：You have proficiency in the Athletics and Perception skills.\n**Leviathan Will**：You have advantage on saving throws against being charmed, frightened, paralyzed, poisoned, stunned, or put to sleep.\n**Limited Amphibiousness**：You can breathe air and water, but you need to be submerged at least once every 4 hours to avoid suffocating.\n**Size**：Locathah stand between 5 and 6 feet tall and average about 150 pounds. Your size is Medium.\n**Language**：You can speak, read, and write Aquan and Common."
  },
  {
    "name": "Lorwyn Changeling",
    "source": "LFL",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Shape Self**：As an action, you can reshape your body to a two-legged Humanoid shape or to a four-legged Beast shape. While you have a Humanoid shape, you can wear clothing and armor made for a Humanoid of your size.\n**Darkvision**：You have Darkvision with a range of 120 feet.\n**Delightful Imitator**：You have proficiency in the Performance skill.\n**Unpredictable Movement**：When you roll Initiative and don't have Disadvantage on that roll, you can take the Dash action as a Reaction."
  },
  {
    "name": "Loxodon",
    "source": "GGR",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "con": 2,
        "wis": 1
      }
    ],
    "entries": "**Age**：Loxodons physically mature at the same rate as humans, but they live about 450 years. They highly value the weight of wisdom and experience and are considered young until they reach the age of 60.\n**Alignment**：Most loxodons are lawful, believing in the value of a peaceful, ordered life. They also tend toward good.\n**Size**：Loxodons stand between 7 and 8 feet tall. Their massive bodies weigh between 300 and 400 pounds. Your size is Medium.\n**Powerful Build**：You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.\n**Loxodon Serenity**：You have advantage on saving throws against being charmed or frightened.\n**Natural Armor**：You have thick, leathery skin. When you aren't wearing armor, your AC is 12 + your Constitution modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor.\nWhen the game gives you more than one way to calculate your Armor Class, you can use only one of them. You choose the one to use. For example, if you have the loxodon's Natural Armor trait and the monk's Unarmored Defense feature, you don't mix them together. Instead, you choose which one determines your AC.\n**Trunk**：You can grasp things with your trunk, and you can use it as a snorkel. It has a reach of 5 feet, and it can lift a number of pounds equal to five times your Strength score. You can use it to do the following simple tasks: lift, drop, hold, push, or pull an object or a creature; open or close a door or a container; grapple someone; or make an unarmed strike. Your DM might allow other simple tasks to be added to that list of options.\nYour trunk can't wield weapons or shields or do anything that requires manual precision, such as using tools or magic items or performing the somatic components of a spell.\n**Keen Smell**：Thanks to your sensitive trunk, you have advantage on Wisdom (Perception), Wisdom (Survival), and Intelligence (Investigation) checks that involve smell.\n**Languages**：You can speak, read, and write Common and Loxodon."
  },
  {
    "name": "Merfolk",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 10,
      "swim": 40
    },
    "ability": {},
    "entries": "**Amphibious**：You can breathe air and water.\n**Languages**：You can speak, read, and write Common and Aquan."
  },
  {
    "name": "Merfolk",
    "source": "PSZ",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "swim": 30
    },
    "ability": [
      {
        "cha": 1
      }
    ],
    "entries": "**Age**：Merfolk mature at the same rate humans do and reach adulthood around the age of 20. They live considerably longer than humans, though, often reaching well over 100 years.\n**Alignment**：Most merfolk are neutral, though merfolk of the Emeria and Cosi creeds have chaotic leanings.\n**Amphibious**：You can breathe air and water.\n**Size**：Merfolk are about the same size and build as humans. Your size is Medium.\n**Swimming**：You have a swimming speed of 30 feet.\n**Languages**：You can speak, read, and write Common, Merfolk, and one extra language of your choice."
  },
  {
    "name": "Minotaur",
    "source": "GGR",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "con": 1
      }
    ],
    "entries": "These traits are also suitable for minotaurs in other D&D worlds where these people have avoided the demonic influence of Baphomet.\n**Age**：Minotaurs enter adulthood at around the age of 17 and can live up to 150 years.\n**Alignment**：Most minotaurs who join the Boros Legion lean toward lawful alignments, while those associated with the Cult of Rakdos or the Gruul Clans tend toward chaotic alignments.\n**Size**：Minotaurs average over 6 feet in height, and they have stocky builds. Your size is Medium.\n**Horns**：Your horns are natural melee weapons, which you can use to make unarmed strikes. If you hit with them, you deal piercing damage equal to 1d6 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n**Goring Rush**：Immediately after you use the Dash action on your turn and move at least 20 feet, you can make one melee attack with your horns as a bonus action.\n**Hammering Horns**：Immediately after you hit a creature with a melee attack as part of the Attack action on your turn, you can use a bonus action to attempt to shove that target with your horns. The target must be no more than one size larger than you and within 5 feet of you. Unless it succeeds on a Strength saving throw against a DC equal to 8 + your proficiency bonus + your Strength modifier, you push it up to 10 feet away from you.\n**Imposing Presence**：You have proficiency in one of the following skills of your choice: Intimidation or Persuasion.\n**Languages**：You can speak, read, and write Common and Minotaur."
  },
  {
    "name": "Minotaur",
    "source": "MOT",
    "size": [],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Minotaur",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Horns**：You have horns that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier piercing damage, instead of the bludgeoning damage normal for an unarmed strike.\n**Goring Rush**：Immediately after you take the Dash action on your turn and move at least 20 feet, you can make one melee attack with your Horns as a bonus action.\n**Hammering Horns**：Immediately after you hit a creature with a melee attack as part of the Attack action on your turn, you can use a bonus action to attempt to push that target with your horns. The target must be within 5 feet of you and no more than one size larger than you. Unless it succeeds on a Strength saving throw against a DC equal to 8 + your proficiency bonus + your Strength modifier, you can push it up to 10 feet away from you.\n**Labyrinthine Recall**：You always know which direction is north, and you have advantage on any Wisdom (Survival) check you make to navigate or track."
  },
  {
    "name": "Minotaur (Amonkhet)",
    "source": "PSA",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "con": 1
      }
    ],
    "entries": "**Age**：Minotaurs develop more slowly than humans, reaching full maturity around the age of 20. They typically become acolytes at around 8 or 9 years old, making them among the older members of their crops. Once they reach maturity, though, minotaurs age quickly, rushing headlong through the trials (as they do all aspects of life) to complete them before they pass their peak. A minotaur allowed to die of old age would rarely live beyond 40.\n**Alignment**：Most minotaurs lean toward chaotic alignments, and they have a slight inclination toward evil.\n**Size**：Minotaurs average over 6 feet in height, and they have strong, stocky builds. Your size is Medium.\n**Natural Weapon**：You can use your horns as a natural weapon to make unarmed strikes. If you hit with your horns, you deal bludgeoning damage equal to 1d6 + your Strength modifier.\n**Menacing**：You gain proficiency in the Intimidation skill.\n**Relentless Endurance**：When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest.\n**Savage Attacks**：When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit.\n**Languages**：You can speak, read, and write Common and Minotaur."
  },
  {
    "name": "Naga",
    "source": "PSA",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "con": 2,
        "int": 1
      }
    ],
    "entries": "**Age**：Like humans, naga reach adulthood in their late teens. They show no signs of aging beyond that point except for growing larger, so in theory, a naga could live well over a century.\n**Alignment**：Most naga are either neutral or neutral evil in alignment.\n**Size**：Naga stand about 5 feet tall when upright, but the total length of their bodies, head to tail, ranges from 10 to as much as 20 feet. Your size is Medium.\n**Speed Burst**：By lowering your body to the ground and propelling yourself with your arms, you can move more quickly for a time. As a bonus action on your turn, if you have both hands free, you can increase your walking speed by 5 feet until the end of your turn.\n**Natural Weapons**：Your fanged maw and constricting serpentine body are natural weapons, which you can use to make unarmed strikes.\nIf you hit with your bite, you deal piercing damage equal to 1d4 + your Strength modifier, and your target must make a Constitution saving throw (8 + your proficiency bonus + your Constitution modifier). On a failed save, the target takes 1d4 poison damage.\nIf you hit with your constrict attack, you deal bludgeoning damage equal to 1d6 + your Strength modifier, and the target is grappled (escape 8 + your proficiency bonus + your Strength modifier). Until this grapple ends, the target is restrained, and you can't constrict another target.\n**Poison Immunity**：You are immune to poison damage and can't be poisoned.\n**Poison Affinity**：You gain proficiency with the poisoner's kit.\n**Languages**：You can speak, read, and write Common and Naga."
  },
  {
    "name": "Orc",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "int": -2
      }
    ],
    "entries": "**Aggressive**：As a bonus action, you can move up to your speed toward a hostile creature that you can see.\n**Darkvision**：Accustomed to life underground, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can speak, read, and write Common and Orc."
  },
  {
    "name": "Orc",
    "source": "EGW",
    "size": [],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Orc",
    "source": "ERLW",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "con": 1
      }
    ],
    "entries": "**Age**：Orcs reach adulthood at age 12 and live up to 50 years.\n**Alignment**：The orcs of Eberron are a passionate people, given to powerful emotion and deep faith. They are generally chaotic, but can be any alignment.\n**Size**：Your size is Medium.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Aggressive**：As a bonus action, you can move up to your movement speed toward a hostile creature you can see or hear. You must end this move closer to the enemy than you started.\n**Primal Intuition**：You have proficiency in two of the following skills of your choice: Animal Handling, Insight, Intimidation, Medicine, Nature, Perception, and Survival.\n**Powerful Build**：You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.\n**Languages**：You can speak, read, and write Common and Orc."
  },
  {
    "name": "Orc",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Adrenaline Rush**：You can take the Dash action as a bonus action. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\nWhenever you use this trait, you gain a number of temporary hit points equal to your proficiency bonus.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Powerful Build**：You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.\n**Relentless Endurance**：When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. Once you use this trait, you can't do so again until you finish a long rest."
  },
  {
    "name": "Orc",
    "source": "VGM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "con": 1
      }
    ],
    "entries": "**Age**：Orcs reach adulthood at age 12 and live up to 50 years.\n**Size**：Orcs are usually over 6 feet tall and weigh between 230 and 280 pounds. Your size is Medium.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Aggressive**：As a bonus action, you can move up to your movement speed toward a hostile creature you can see or hear. You must end this move closer to the enemy than you started.\n**Primal Intuition**：You have proficiency in two of the following skills of your choice: Animal Handling, Insight, Intimidation, Medicine, Nature, Perception, and Survival.\n**Powerful Build**：You count as one size larger when determining your carrying capacity and the weight you can push, drag, or lift.\n**Languages**：You can speak, read, and write Common and Orc."
  },
  {
    "name": "Orc",
    "source": "XPHB",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Adrenaline Rush**：You can take the Dash action as a Bonus Action. When you do so, you gain a number of Temporary Hit Points equal to your Proficiency.\nYou can use this trait a number of times equal to your Proficiency, and you regain all expended uses when you finish a Short Rest or Long Rest.\n**Darkvision**：You have Darkvision with a range of 120 feet.\n**Relentless Endurance**：When you are reduced to 0 Hit Points but not killed outright, you can drop to 1 Hit Points instead. Once you use this trait, you can't do so again until you finish a Long Rest."
  },
  {
    "name": "Orc (Ixalan)",
    "source": "PSX",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "con": 1
      }
    ],
    "entries": "**Age**：Orcs mature a little faster than humans, reaching adulthood around age 14. They age noticeably faster and rarely live longer than 75 years.\n**Alignment**：Most orcs lean toward chaotic alignments, and many serve on pirate ships that encourage an inclination toward evil.\n**Size**：Orcs average over 6 feet in height, and they have strong, stocky builds. Your size is Medium.\n**Menacing**：You gain proficiency in the Intimidation skill.\n**Relentless Endurance**：When you are reduced to 0 hit points but not killed outright, you can drop to 1 hit point instead. You can't use this feature again until you finish a long rest.\n**Savage Attacks**：When you score a critical hit with a melee weapon attack, you can roll one of the weapon's damage dice one additional time and add it to the extra damage of the critical hit.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can speak, read, and write Common Trade Pidgin (if it exists in your campaign) and Orc."
  },
  {
    "name": "Owlin",
    "source": "SCC",
    "size": [
      "S",
      "M"
    ],
    "speed": {
      "walk": 30,
      "fly": true
    },
    "ability": {},
    "entries": "**Size**：You are Medium or Small. You choose the size when you select this race.\n**Darkvision**：You can see in dim light within 120 feet of yourself as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Flight**：Thanks to your wings, you have a flying speed equal to your walking speed. You can't use this flying speed if you're wearing medium or heavy armor.\n**Silent Feathers**：You have proficiency in the Stealth skill."
  },
  {
    "name": "Plasmoid",
    "source": "AAG",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are an Ooze.\n**Size**：You are Medium or Small. You choose the size when you select this race.\n**Amorphous**：You can squeeze through a space as narrow as 1 inch wide, provided you are wearing and carrying nothing. You have advantage on ability checks you make to initiate or escape a grapple.\n**Darkvision**：You can see in dim light within 60 feet of yourself as if it were bright light, and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Hold Breath**：You can hold your breath for 1 hour.\n**Natural Resilience**：You have resistance to acid and poison damage, and you have advantage on saving throws against being poisoned.\n**Shape Self**：As an action, you can reshape your body to give yourself a head, one or two arms, one or two legs, and makeshift hands and feet, or you can revert to a limbless blob. While you have a humanlike shape, you can wear clothing and armor made for a Humanoid of your size.\nAs a bonus action, you can extrude a pseudopod that is up to 6 inches wide and 10 feet long or reabsorb it into your body. As part of the same bonus action, you can use this pseudopod to manipulate an object, open or close a door or container, or pick up or set down a Tiny object. The pseudopod contains no sensory organs and can't attack, activate magic items, or lift more than 10 pounds."
  },
  {
    "name": "Reborn",
    "source": "VRGR",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Size**：You are Medium or Small. You choose the size when you gain this lineage.\n**Ancestral Legacy**：If you replace a race with this lineage, you can keep the following elements of that race: any skill proficiencies you gained from it and any climbing, flying, or swimming speed you gained from it.\nIf you don't keep any of those elements or you choose this lineage at character creation, you gain proficiency in two skills of your choice.\n**Deathless Nature**：You have escaped death, a fact represented by the following benefits:\n• You have advantage on saving throws against disease and being poisoned, and you have resistance to poison damage.\n• You have advantage on death saving throws.\n• You don't need to eat, drink, or breathe.\n• You don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in an inactive, motionless state, during which you retain consciousness.\n**Knowledge from a Past Life**：You temporarily remember glimpses of the past, perhaps faded memories from ages ago or a previous life. When you make an ability check that uses a skill, you can roll a d6 immediately after seeing the number on the d20 and add the number on the d6 to the check. You can use this feature a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest."
  },
  {
    "name": "Rimekin",
    "source": "LFL",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Cold Fire Magic**：You know the Ray of Frost cantrip. When you reach character levels 3 and 5, you learn the Ice Knife spell and the Flame Blade spell, respectively. You always have those spells prepared. You can cast each once without a spell slot, and you regain the ability to cast these spells in this way when you finish a Long Rest. You can also cast the spells using any spell slots you have of the appropriate level. When you cast Flame Blade using this trait, the spell deals Cold damage instead of Fire damage.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells (choose the ability when you select this species).\n**Cold Resistance**：You have Resistance to Cold damage.\n**Darkvision**：You have Darkvision with a range of 60 feet."
  },
  {
    "name": "Satyr",
    "source": "MOT",
    "size": [
      "M"
    ],
    "speed": 35,
    "ability": [
      {
        "cha": 2,
        "dex": 1
      }
    ],
    "entries": "**Age**：Satyrs mature and age at about the same rate as humans.\n**Alignment**：Satyrs delight in living a life free of the mantle of law. They gravitate toward being good, but some have devious streaks and enjoy causing dismay.\n**Size**：Satyrs range from just under 5 feet to about 6 feet in height, with generally slender builds. Your size is Medium.\n**Fey**：Your creature type is fey, rather than humanoid.\n**Ram**：You can use your head and horns to make unarmed strikes. If you hit with them, you deal bludgeoning damage equal to 1d4 + your Strength modifier.\n**Magic Resistance**：You have advantage on saving throws against spells and other magical effects.\n**Mirthful Leaps**：Whenever you make a long or high jump, you can roll a d8 and add the number rolled to the number of feet you cover, even when making a standing jump. This extra distance costs movement as normal.\n**Reveler**：You have proficiency in the Performance and Persuasion skills, and you have proficiency with one musical instrument of your choice.\n**Languages**：You can speak, read, and write Common and Sylvan."
  },
  {
    "name": "Satyr",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 35,
    "ability": {},
    "entries": "**Creature Type**：You are a Fey.\n**Ram**：You can use your head and horns to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier bludgeoning damage, instead of the bludgeoning damage normal for an unarmed strike.\n**Magic Resistance**：You have advantage on saving throws against spells.\n**Mirthful Leaps**：Whenever you make a long jump or a high jump, you can roll a d8 and add the number rolled to the number of feet you cover, even when making a standing jump. This extra distance costs movement as usual.\n**Reveler**：As an embodiment of revelry, you have proficiency in the Performance and Persuasion skills, and you have proficiency with one musical instrument of your choice."
  },
  {
    "name": "Sea Elf",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "swim": true
    },
    "ability": {},
    "entries": "**Creature Type**：You are a Humanoid. You are also considered an elf for any prerequisite or effect that requires you to be an elf.\n**Speed**：Your walking speed is 30 feet, and you have a swimming speed equal to your walking speed.\n**Child of the Sea**：You can breathe air and water, and you have resistance to cold damage.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Fey Ancestry**：You have advantage on saving throws you make to avoid or end the charmed condition on yourself.\n**Friend of the Sea**：Aquatic animals have an extraordinary affinity with your people. You can communicate simple ideas to any Beast that has a swimming speed. It can understand your words, though you have no special ability to understand it in return.\n**Keen Senses**：You have proficiency in the Perception skill.\n**Trance**：You don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness.\nWhenever you finish this trance, you can gain two proficiencies that you don't have, each one with a weapon or a tool of your choice selected from the Player's Handbook. You mystically acquire these proficiencies by drawing them from shared elven memory, and you retain them until you finish your next long rest."
  },
  {
    "name": "Shadar-Kai",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are a Humanoid. You are also considered an elf for any prerequisite or effect that requires you to be an elf.\n**Blessing of the Raven Queen**：As a bonus action, you can magically teleport up to 30 feet to an unoccupied space you can see. You can use this trait a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\nStarting at 3rd level, you also gain resistance to all damage when you teleport using this trait. The resistance lasts until the start of your next turn. During that time, you appear ghostly and translucent.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Fey Ancestry**：You have advantage on saving throws you make to avoid or end the charmed condition on yourself.\n**Keen Senses**：You have proficiency in the Perception skill.\n**Necrotic Resistance**：You have resistance to necrotic damage.\n**Trance**：You don't need to sleep, and magic can't put you to sleep. You can finish a long rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness.\nWhenever you finish this trance, you can gain two proficiencies that you don't have, each one with a weapon or a tool of your choice selected from the Player's Handbook. You mystically acquire these proficiencies by drawing them from shared elven memory, and you retain them until you finish your next long rest."
  },
  {
    "name": "Shifter",
    "source": "EFA",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Bestial Instincts**：Channeling the beast within, you gain proficiency in one of the following skills of your choice: Acrobatics, Athletics, Intimidation, or Survival.\n**Darkvision**：You have Darkvision with a range of 60 feet.\n**Shifting**：As a Bonus Action, you can shape-shift to assume a more bestial appearance. This transformation lasts for 1 minute or until you revert to your normal appearance as a Bonus Action. When you shift, you gain Temporary Hit Points equal to 2 times your Proficiency. You can shift a number of times equal to your Proficiency, and you regain all expended uses when you finish a Long Rest.\nWhenever you shift, you gain the benefit of one of the following options (choose when you select this species)\n• {'type': 'item', 'name': 'Beasthide', 'entries': ['You gain {@dice 1d6} additional {@variantrule Temporary Hit Points|XPHB}. While shifted, you have a +1 bonus to your {@variantrule Armor Class|XPHB}.']}\n• {'type': 'item', 'name': 'Longtooth', 'entries': ['When you shift and as a {@variantrule Bonus Action|XPHB} on your other turns while shifted, you can use your elongated fangs to make an {@variantrule Unarmed Strike|XPHB}. If you hit with this {@variantrule Unarmed Strike|XPHB} and deal damage, you can deal Piercing damage equal to {@dice 1d6} plus your Strength modifier, instead of the normal damage of an {@variantrule Unarmed Strike|XPHB}.']}\n• {'type': 'item', 'name': 'Swiftstride', 'entries': [\"While you are shifted, your {@variantrule Speed|XPHB} increases by 10 feet. Additionally, you can move up to 10 feet as a {@variantrule Reaction|XPHB} when a creature ends its turn within 5 feet of you. This reactive movement doesn't provoke {@action Opportunity Attack|XPHB|Opportunity Attacks}.\"]}\n• {'type': 'item', 'name': 'Wildhunt', 'entries': ['While shifted, you have {@variantrule Advantage|XPHB} on Wisdom checks. Additionally, no creature within 30 feet of you can have {@variantrule Advantage|XPHB} on an attack roll against you unless you have the {@condition Incapacitated|XPHB} condition.']}"
  },
  {
    "name": "Shifter",
    "source": "ERLW",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Age**：Shifters are quick to mature both physically and emotionally, reaching young adulthood at age 10. They rarely live to be more than 70 years old.\n**Alignment**：Shifters tend toward neutrality, being more focused on survival than concepts of good and evil. A love of personal freedom can drive shifters toward chaotic alignments.\n**Size**：Your size is Medium.\n**Speed**：Your base walking speed is 30 feet.\n**Darkvision**：You have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Shifting**：As a bonus action, you can assume a more bestial appearance. This transformation lasts for 1 minute, until you die, or until you revert to your normal appearance as a bonus action. When you shift, you gain temporary hit points equal to your level + your Constitution modifier (minimum of 1 temporary hit point). You also gain additional benefits that depend on your shifter subrace, described below.\nOnce you shift, you can't do so again until you finish a short or long rest.\n**Languages**：You can speak, read, and write Common."
  },
  {
    "name": "Shifter",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Bestial Instincts**：Channeling the beast within, you have proficiency in one of the following skills of your choice: Acrobatics, Athletics, Intimidation, or Survival.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were in dim light. You discern colors in that darkness only as shades of gray.\n**Shifting**：As a bonus action, you can assume a more bestial appearance. This transformation lasts for 1 minute, until you die, or until you revert to your normal appearance as a bonus action. When you shift, you gain temporary hit points equal to 2 × your proficiency bonus. You can shift a number of times equal to your proficiency bonus, and you regain all expended uses when you finish a long rest.\nWhenever you shift, you gain an additional benefit based on one of the following options (choose when you select this race):\n• {'type': 'item', 'name': 'Beasthide', 'entry': 'You gain {@dice 1d6} additional temporary hit points. While shifted, you have a +1 bonus to your Armor Class.'}\n• {'type': 'item', 'name': 'Longtooth', 'entry': 'When you shift and as a bonus action on your other turns while shifted, you can use your elongated fangs to make an unarmed strike. If you hit with your fangs, you can deal piercing damage equal to {@damage 1d6} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.'}\n• {'type': 'item', 'name': 'Swiftstride', 'entry': \"While shifted, your walking speed increases by 10 feet. Additionally, you can move up to 10 feet as a reaction when a creature ends its turn within 5 feet of you. This reactive movement doesn't provoke opportunity attacks.\"}\n• {'type': 'item', 'name': 'Wildhunt', 'entry': \"While shifted, you have advantage on Wisdom checks, and no creature within 30 feet of you can make an attack roll with advantage against you unless you're {@condition incapacitated}.\"}"
  },
  {
    "name": "Simic Hybrid",
    "source": "GGR",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30
    },
    "ability": [
      {
        "con": 2,
        "choose": {
          "from": [
            "str",
            "dex",
            "int",
            "wis",
            "cha"
          ],
          "count": 1
        }
      }
    ],
    "entries": "**Age**：Hybrids begin their lives as adult humans, elves, or vedalken. They age at a slightly accelerated rate, so their maximum life spans are probably reduced somewhat. The Guardian Project has not been operating long enough to observe the full effect of this phenomenon.\n**Alignment**：Most hybrids share the generally neutral outlook of the Simic Combine. They are more interested in scientific research and the standing of their guild than in moral or ethical questions. Those who leave the Combine, however, often do so because their philosophical outlook and alignment are more in line with a different guild's.\n**Size**：Your size is Medium, within the normal range of your humanoid base race.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can speak, read, and write Common and your choice of Elvish or Vedalken.\n**Animal Enhancement**：Your body has been altered to incorporate certain animal characteristics. You choose one animal enhancement now and a second enhancement at 5th level.\nAt 1st level, choose one of the following options:\n• {'type': 'item', 'name': 'Manta Glide', 'entry': \"You have ray-like fins that you can use as wings to slow your fall or allow you to glide. When you fall and aren't {@condition incapacitated}, you can subtract up to 100 feet from the fall when calculating falling damage, and you can move up to 2 feet horizontally for every 1 foot you descend.\"}\n• {'type': 'item', 'name': 'Nimble Climber', 'entry': 'You have a climbing speed equal to your walking speed.'}\n• {'type': 'item', 'name': 'Underwater Adaptation', 'entry': 'You can breathe air and water, and you have a swimming speed equal to your walking speed.'}\nAt 5th level, your body evolves further, developing new characteristics. Choose one of the options you didn't take at 1st level, or one of the following options:\n• {'type': 'item', 'name': 'Grappling Appendage', 'entry': \"You have two special appendages growing alongside your arms. Choose whether they're both claws or tentacles. As an action, you can use one of them to try to grapple a creature. Each one is also a natural weapon, which you can use to make an unarmed strike. If you hit with it, the target takes bludgeoning damage equal to {@damage 1d6} + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike. Immediately after hitting, you can try to grapple the target as a bonus action. These appendages can't precisely manipulate anything and can't wield weapons, magic items, or other specialized equipment.\"}\n• {'type': 'item', 'name': 'Carapace', 'entry': \"Your skin in places is covered by a thick shell. You gain a +1 bonus to AC when you're not wearing heavy armor.\"}\n• {'type': 'item', 'name': 'Acid Spit', 'entry': 'As an action, you can spray acid from glands in your mouth, targeting one creature or object you can see within 30 feet of you. The target takes {@damage 2d10} acid damage unless it succeeds on a Dexterity saving throw against a DC equal to 8 + your Constitution modifier + your proficiency bonus. This damage increases by {@damage 1d10} when you reach 11th level ({@damage 3d10}) and 17th level ({@damage 4d10}). You can use this trait a number of times equal to your Constitution modifier (minimum of once), and you regain all expended uses of it when you finish a long rest.'}"
  },
  {
    "name": "Siren",
    "source": "PSX",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 25,
      "fly": 30
    },
    "ability": [
      {
        "cha": 2
      }
    ],
    "entries": "**Alignment**：Most sirens lean toward chaotic alignment, cherishing the freedom and independence that comes from joining a pirate crew.\n**Size**：Sirens stand about 5 to 6 feet tall, but their bodies are slender and their bones partially hollow to facilitate their flight. Your size is Medium.\n**Siren's Song**：You know the friends cantrip and can cast it without material components.\n**Flight**：You have a flying speed of 30 feet. You can't use your flying speed while you wear medium or heavy armor. (If your campaign uses the variant rule for encumbrance, you can't use your flying speed if you are encumbered.)\n**Languages**：You can speak, read, and write Common Trade Pidgin (if it exists in your campaign) and Siren."
  },
  {
    "name": "Skeleton",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "dex": 2,
        "int": -4,
        "cha": -4
      }
    ],
    "entries": "**Creature Type**：You are Undead.\n**Brittle Bones**：You are vulnerable to bludgeoning damage.\n**Undead Nature**：You are immune to poison damage and exhaustion, and you can't be poisoned. You don't require air, food, drink, or sleep.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can't speak, but you can understand the languages you knew in life."
  },
  {
    "name": "Tabaxi",
    "source": "MPMM",
    "size": [
      "S",
      "M"
    ],
    "speed": {
      "walk": 30,
      "climb": true
    },
    "ability": {},
    "entries": "**Size**：You are Medium or Small. You choose the size when you select this race.\n**Speed**：Your walking speed is 30 feet, and you have a climbing speed equal to your walking speed.\n**Cat's Claws**：You can use your claws to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike.\n**Cat's Talent**：You have proficiency in the Perception and Stealth skills.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Feline Agility**：Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the turn. Once you use this trait, you can't use it again until you move 0 feet on one of your turns."
  },
  {
    "name": "Tabaxi",
    "source": "VGM",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "climb": 20
    },
    "ability": [
      {
        "dex": 2,
        "cha": 1
      }
    ],
    "entries": "**Age**：Tabaxi have lifespans equivalent to humans.\n**Size**：Tabaxi are taller on average than humans and relatively slender. Your size is Medium.\n**Darkvision**：You have a cat's keen senses, especially in the dark. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Feline Agility**：Your reflexes and agility allow you to move with a burst of speed. When you move on your turn in combat, you can double your speed until the end of the turn. Once you use this trait, you can't use it again until you move 0 feet on one of your turns.\n**Cat's Claws**：Because of your claws, you have a climbing speed of 20 feet. In addition, your claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d4 + your Strength modifier, instead of the bludgeoning damage normal for an unarmed strike.\n**Cat's Talents**：You have proficiency in the Perception and Stealth skills.\n**Languages**：You can speak, read, and write Common and one other language of your choice."
  },
  {
    "name": "Thri-kreen",
    "source": "AAG",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Creature Type**：You are a Monstrosity.\n**Size**：You are Medium or Small. You choose the size when you select this race.\n**Chameleon Carapace**：While you aren't wearing armor, your carapace gives you a base Armor Class of 13 + your Dexterity modifier.\nAs an action, you can change the color of your carapace to match the color and texture of your surroundings, giving you advantage on Dexterity (Stealth) checks made to hide in those surroundings.\n**Darkvision**：You can see in dim light within 60 feet of yourself as if it were bright light, and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Secondary Arms**：You have two slightly smaller secondary arms below your primary pair of arms. The secondary arms can manipulate an object, open or close a door or container, pick up or set down a Tiny object, or wield a weapon that has the L property.\n**Sleepless**：You do not require sleep and can remain conscious during a long rest, though you must still refrain from strenuous activity to gain the benefit of the rest.\n**Thri-kreen Telepathy**：Without the assistance of magic, you can't speak the non-thri-kreen languages you know. Instead you use telepathy to convey your thoughts. You have the magical ability to transmit your thoughts mentally to willing creatures within 120 feet of yourself. A contacted creature doesn't need to share a language with you to understand your thoughts, but it must be able to understand at least one language. Your telepathic link to a creature is broken if you and the creature move more than 120 feet apart, if either of you is incapacitated, or if either of you mentally breaks the contact (no action required)."
  },
  {
    "name": "Tiefling",
    "source": "PHB",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "cha": 2,
        "int": 1
      }
    ],
    "entries": "**Age**：Tieflings mature at the same rate as humans but live a few years longer.\n**Size**：Tieflings are about the same size and build as humans. Your size is Medium.\n**Darkvision**：Thanks to your infernal heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Hellish Resistance**：You have resistance to fire damage.\n**Infernal Legacy**：You know the thaumaturgy cantrip. Once you reach 3rd level, you can cast the hellish rebuke spell as a 2nd-level spell with this trait; you regain the ability to cast it when you finish a long rest. Once you reach 5th level, you can also cast the darkness spell once per day with this trait; you regain the ability to cast it when you finish a long rest. Charisma is your spellcasting ability for these spells.\n**Languages**：You can speak, read, and write Common and Infernal."
  },
  {
    "name": "Tiefling",
    "source": "XPHB",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Darkvision**：You have Darkvision with a range of 60 feet.\n**Fiendish Legacy**：You are the recipient of a legacy that grants you supernatural abilities. Choose a legacy from the Fiendish Legacies table. You gain the level 1 benefit of the chosen legacy.\nWhen you reach character levels 3 and 5, you learn a higher-level spell, as shown on the table. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have of the appropriate level. Intelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the legacy).\n[表格: Fiendish Legacies]\n**Otherworldly Presence**：You know the Thaumaturgy cantrip. When you cast it with this trait, the spell uses the same spellcasting ability you use for your Fiendish Legacy Trait."
  },
  {
    "name": "Tortle",
    "source": "MPMM",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Size**：You are Medium or Small. You choose the size when you select this race.\n**Claws**：You have claws that you can use to make unarmed strikes. When you hit with them, the strike deals 1d6 + your Strength modifier slashing damage, instead of the bludgeoning damage normal for an unarmed strike.\n**Hold Breath**：You can hold your breath for up to 1 hour.\n**Natural Armor**：Your shell provides you a base AC of 17 (your Dexterity modifier doesn't affect this number). You can't wear light, medium, or heavy armor, but if you are using a shield, you can apply the shield's bonus as normal.\n**Nature's Intuition**：Thanks to your mystical connection to nature, you gain proficiency with one of the following skills of your choice: Animal Handling, Medicine, Nature, Perception, Stealth, or Survival.\n**Shell Defense**：You can withdraw into your shell as an action. Until you emerge, you gain a +4 bonus to your AC, and you have advantage on Strength and Constitution saving throws. While in your shell, you are prone, your speed is 0 and can't increase, you have disadvantage on Dexterity saving throws, you can't take reactions, and the only action you can take is a bonus action to emerge from your shell."
  },
  {
    "name": "Tortle",
    "source": "TTP",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "wis": 1
      }
    ],
    "entries": "The Tortle Package is considered part of Xanathar's Guide to Everything for Adventurers League character creation.\n**Age**：Young tortles crawl for a few weeks after birth before learning to walk on two legs. They reach adulthood by the age of 15 and live an average of 50 years.\n**Alignment**：Tortles tend to lead orderly, ritualistic lives. They develop customs and routines, becoming more set in their ways as they age. Most are lawful good. A few can be selfish and greedy, tending more toward evil, but it's unusual for a tortle to shuck off order in favor of chaos.\n**Size**：Tortle adults stand 5 to 6 feet tall and average 450 pounds. Their shells account for roughly one-third of their weight. Your size is Medium.\n**Claws**：Your claws are natural weapons, which you can use to make unarmed strikes. If you hit with them, you deal slashing damage equal to 1d4 + your Strength modifier, instead of bludgeoning damage normal for an unarmed strike.\n**Hold Breath**：You can hold your breath for up to 1 hour at a time. Tortles aren't natural swimmers, but they can remain underwater for some time before needing to come up for air.\n**Natural Armor**：Due to your shell and the shape of your body, you are ill-suited to wearing armor. Your shell provides ample protection, however; it gives you a base AC of 17 (your Dexterity modifier doesn't affect this number). You gain no benefit from wearing armor, but if you are using a shield, you can apply the shield's bonus as normal.\n**Shell Defense**：You can withdraw into your shell as an action. Until you emerge, you gain a +4 bonus to AC, and you have advantage on Strength and Constitution saving throws. While in your shell, you are prone, your speed is 0 and can't increase, you have disadvantage on Dexterity saving throws, you can't take reactions, and the only action you can take is a bonus action to emerge from your shell.\n**Survival Instinct**：You gain proficiency in the Survival skill. Tortles have finely honed survival instincts.\n**Languages**：You can speak, read, and write Aquan and Common."
  },
  {
    "name": "Triton",
    "source": "MOT",
    "size": [],
    "speed": {},
    "ability": {},
    "entries": ""
  },
  {
    "name": "Triton",
    "source": "MPMM",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "swim": true
    },
    "ability": {},
    "entries": "**Speed**：Your walking speed is 30 feet, and you have a swimming speed equal to your walking speed.\n**Amphibious**：You can breathe air and water.\n**Control Air and Water**：You can cast fog cloud with this trait. Starting at 3rd level, you can cast the gust of wind spell with this trait. Starting at 5th level, you can also cast the water walk spell with it. Once you cast any of these spells with this trait, you can't cast that spell with it again until you finish a long rest. You can also cast these spells using any spell slots you have of the appropriate level.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race).\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Emissary of the Sea**：You can communicate simple ideas to any Beast, Elemental, or Monstrosity that has a swimming speed. It can understand your words, though you have no special ability to understand it in return.\n**Guardian of the Depths**：Adapted to the frigid ocean depths, you have resistance to cold damage."
  },
  {
    "name": "Triton",
    "source": "VGM",
    "size": [
      "M"
    ],
    "speed": {
      "walk": 30,
      "swim": 30
    },
    "ability": [
      {
        "str": 1,
        "cha": 1,
        "con": 1
      }
    ],
    "entries": "**Age**：Tritons reach maturity around age 15 and can live up to 200 years.\n**Size**：Tritons are slightly shorter than humans, averaging about 5 feet tall. Your size is Medium.\n**Swim Speed**：You have a swimming speed of 30 feet.\n**Amphibious**：You can breathe air and water.\n**Control Air and Water**：A child of the sea, you can call on the magic of elemental air and water. You can cast fog cloud with this trait. Starting at 3rd level, you can cast gust of wind with it, and starting at 5th level, you can also cast wall of water with it. Once you cast a spell with this trait, you can't cast that spell with it again until you finish a long rest. Charisma is your spellcasting ability for these spells.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Emissary of the Sea**：Aquatic beasts have an extraordinary affinity with your people. You can communicate simple ideas with beasts that can breathe water. They can understand the meaning of your words, though you have no special ability to understand them in return.\n**Guardians of the Depths**：Adapted to even the most extreme ocean depths, you have resistance to cold damage.\n**Languages**：You can speak, read, and write Common and Primordial."
  },
  {
    "name": "Troglodyte",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 2,
        "con": 2,
        "int": -4,
        "cha": -4
      }
    ],
    "entries": "**Chameleon Skin**：You have advantage on Dexterity (Stealth) checks made to hide.\n**Stench**：Any creature other than a troglodyte that starts its turn within 5 ft. of you must succeed on a 12 Constitution saving throw or be poisoned until the start of the creature's next turn. On a successful saving throw, the creature is immune to the stench of all troglodytes for 1 hour.\n**Sunlight Sensitivity**：While in sunlight, you have disadvantage on attack rolls, as well as on Wisdom (Perception) checks that rely on sight.\n**Natural Armor**：Your thick hide grants you a +1 bonus to Armor Class.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can speak, read, and write Troglodyte."
  },
  {
    "name": "Vampire",
    "source": "PSZ",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "cha": 2
      }
    ],
    "entries": "**Age**：Vampires don't mature and age in the same way that other races do. Every living vampire is either a bloodchief, infected by Ulamog's influence in the distant reaches of history, or was spawned by a bloodchief from a living human. Most vampires are thus very old, but few have any memory of their earliest years.\n**Alignment**：Vampires have no innate tendency toward evil, but consuming the life energy of other creatures often pushes them to that end. Regardless of their moral bent, the strict hierarchies of their bloodchiefs inclines them toward a lawful alignment.\n**Size**：Vampires are about the same size and build as humans. Your size is Medium.\n**Blood Thirst**：You can drain blood and life energy from a willing creature, or one that is grappled by you, incapacitated, or restrained. Make a melee attack against the target. If you hit, you deal 1 piercing damage and 1d6 necrotic damage. The target's hit point maximum is reduced by an amount equal to the necrotic damage taken, and you regain hit points equal to that amount. The reduction lasts until the target finishes a long rest. The target dies if this effect reduces its hit point maximum to 0.\n**Darkvision**：Thanks to your heritage, you have superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can speak, read, and write Common and Vampire.\n**Vampiric Resistance**：You have resistance to necrotic damage."
  },
  {
    "name": "Vedalken",
    "source": "GGR",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "int": 2,
        "wis": 1
      }
    ],
    "entries": "**Age**：Vedalken mature slower than humans do, reaching maturity around age 40. Their life span is typically 350 years, with some living to the age of 500.\n**Alignment**：Vedalken are usually lawful and non-evil.\n**Size**：Tall and slender, Vedalken stand 6 to 6½ feet tall on average and usually weigh less than 200 pounds. Your size is Medium.\n**Vedalken Dispassion**：You have advantage on all Intelligence, Wisdom, and Charisma saving throws.\n**Tireless Precision**：You are proficient in one of the following skills of your choice: Arcana, History, Investigation, Medicine, Performance, or Sleight of Hand. You are also proficient with one tool of your choice.\nWhenever you make an ability check with the chosen skill or tool, roll a d4 and add the number rolled to the check's total.\n**Partially Amphibious**：By absorbing oxygen through your skin, you can breathe underwater for up to 1 hour. Once you've reached that limit, you can't use this trait again until you finish a long rest.\n**Languages**：You can speak, read, and write Common, Vedalken, and one other language of your choice."
  },
  {
    "name": "Vedalken",
    "source": "PSK",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "int": 2,
        "wis": 1
      }
    ],
    "entries": "**Age**：Vedalken mature at the same rate humans do, and most are expected to settle down into an adult life by around age 40. They can live 350 to almost 500 years.\n**Alignment**：Vedalken are most often lawful and rarely evil.\n**Size**：Vedalken are taller than humans but more slender. They average 6 to 6½ feet tall, but usually weigh less than 200 pounds. Your size is Medium.\n**Languages**：You can speak, read, and write Common and Vedalken. The Vedalken language is renowned for its technical treatises and its catalogs of knowledge about the natural world and the aether that pervades it.\n**Vedalken Cunning**：You have advantage on all Intelligence, Wisdom, and Charisma saving throws against magic.\n**Aether Lore**：Whenever you make an Intelligence (History) check related to magic items or aether-powered technological devices, you can add twice your proficiency bonus, instead of any proficiency bonus you normally apply."
  },
  {
    "name": "Verdan",
    "source": "AI",
    "size": [
      "V"
    ],
    "speed": 30,
    "ability": [
      {
        "con": 1,
        "cha": 2
      }
    ],
    "entries": "**Age**：Verdan reach adulthood at around the age of 24, and it is thought that they might live to nearly 200 years old. However, because no verdan has died of old age since the race's initial creation, their upper age limits remain subject to speculation.\n**Alignment**：Verdan are generally good, although their absence of racial identity and shared history can sometimes see individual verdan become untethered from any moral or ethical framework.\n**Size**：Verdan start out similar in size to the goblins they were created from, ranging from 3 to 4 feet in height. But at some point after reaching maturity, each verdan undergoes a sudden growth spurt of 2 feet or more. At 1st level, you are a Small creature. When you reach 5th level, you become a Medium creature.\n**Black Blood Healing**：The black blood that is a sign of your people's connection to That-Which-Endures boosts your natural healing. When you roll a 1 or 2 on any Hit Die you spend at the end of a short rest, you can reroll the die and must use the new roll.\n**Limited Telepathy**：You can telepathically speak to any creature you can see within 30 feet of you. You don't need to share a language with the creature for it to understand your telepathy, but it must be able to understand at least one language. This process of communication is slow and limited, allowing you to transmit and receive only simple ideas and straightforward concepts.\n**Persuasive**：Your people's lack of history makes you trustworthy and humble. You have proficiency in the Persuasion skill.\n**Telepathic Insight**：Your mind's connection to the world around you strengthens your will. You have advantage on all Wisdom and Charisma saving throws.\n**Language**：You speak, read, and write Common, Goblin, and one additional language of your choice. This language typically has some connection to one of the areas or cultures that has been part of your life."
  },
  {
    "name": "Warforged",
    "source": "EFA",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Construct Resilience**：You have Resistance to Poison damage. You also have Advantage on saving throws to avoid or end the Poisoned condition.\n**Integrated Protection**：You gain a +1 bonus to your Armor Class. In addition, armor you have donned can't be removed against your will while you're alive.\n**Sentry's Rest**：You don't need to sleep, and magic can't put you to sleep. You can finish a Long Rest in 6 hours if you spend those hours in an inactive, motionless state. During this time, you appear inert but remain conscious.\n**Specialized Design**：You gain one skill proficiency and one tool proficiency of your choice.\n**Tireless**：You don't gain Exhaustion levels from dehydration, malnutrition, or suffocation."
  },
  {
    "name": "Warforged",
    "source": "ERLW",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "con": 2,
        "choose": {
          "from": [
            "str",
            "dex",
            "int",
            "wis",
            "cha"
          ],
          "count": 1
        }
      }
    ],
    "entries": "**Age**：A typical warforged is between two and thirty years old. The maximum warforged lifespan remains a mystery; so far, warforged have shown no signs of deterioration due to age. You are immune to magical aging effects.\n**Alignment**：Most warforged take comfort in order and discipline, tending toward law and neutrality. But some have absorbed the morality, or lack thereof, of the beings with which they served.\n**Size**：Your size is Medium.\n**Constructed Resilience**：You were created to have remarkable fortitude, represented by the following benefits:\n• You have advantage on saving throws against being poisoned, and you have resistance to poison damage.\n• You don't need to eat, drink, or breathe.\n• You are immune to disease.\n• You don't need to sleep, and magic can't put you to sleep.\n**Sentry's Rest**：When you take a long rest, you must spend at least six hours in an inactive, motionless state, rather than sleeping. In this state, you appear inert, but it doesn't render you unconscious, and you can see and hear as normal.\n**Integrated Protection**：Your body has built-in defensive layers, which can be enhanced with armor:\n• You gain a +1 bonus to Armor Class.\n• You can don only armor with which you have proficiency. To don armor other than a shield, you must incorporate it into your body over the course of 1 hour, during which you remain in contact with the armor. To doff armor, you must spend 1 hour removing it. You can rest while donning or doffing armor in this way.\n• While you live, the armor incorporated into your body can't be removed against your will.\n**Specialized Design**：You gain one skill proficiency and one tool proficiency of your choice.\n**Languages**：You can speak, read, and write Common and one other language of your choice."
  },
  {
    "name": "Yuan-Ti",
    "source": "MPMM",
    "size": [
      "S",
      "M"
    ],
    "speed": 30,
    "ability": {},
    "entries": "**Size**：You are Medium or Small. You choose the size when you select this race.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray.\n**Magic Resistance**：You have advantage on saving throws against spells.\n**Poison Resilience**：You have advantage on saving throws you make to avoid or end the poisoned condition on yourself. You also have resistance to poison damage.\n**Serpentine Spellcasting**：You know the poison spray cantrip. You can cast animal friendship an unlimited number of times with this trait, but you can target only snakes with it. Starting at 3rd level, you can also cast suggestion with this trait. Once you cast it, you can't do so again until you finish a long rest. You can also cast it using any spell slots you have of 2nd level or higher.\nIntelligence, Wisdom, or Charisma is your spellcasting ability for these spells when you cast them with this trait (choose when you select this race)."
  },
  {
    "name": "Yuan-ti Pureblood",
    "source": "VGM",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "cha": 2,
        "int": 1
      }
    ],
    "entries": "**Age**：Purebloods mature at the same rate as humans and have lifespans similar in length to theirs.\n**Size**：Purebloods match humans in average size and weight. Your size is Medium.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Innate Spellcasting**：You know the poison spray cantrip. You can cast animal friendship an unlimited number of times with this trait, but you can target only snakes with it. Starting at 3rd level, you can also cast suggestion with this trait. Once you cast it, you can't do so again until you finish a long rest. Charisma is your spellcasting ability for these spells.\n**Magic Resistance**：You have advantage on saving throws against spells and other magical effects.\n**Poison Immunity**：You are immune to poison damage and the poisoned condition.\n**Languages**：You can speak, read, and write Common, Abyssal, and Draconic."
  },
  {
    "name": "Zombie",
    "source": "DMG",
    "size": [
      "M"
    ],
    "speed": 30,
    "ability": [
      {
        "str": 1,
        "con": 2,
        "int": -6,
        "wis": -4,
        "cha": -4
      }
    ],
    "entries": "**Creature Type**：You are Undead.\n**Undead Fortitude**：If damage reduces you to 0 hit points, you must make a Constitution saving throw with a DC of 5+the damage taken, unless the damage is radiant or from a critical hit. On a success, you drop to 1 hit point instead.\n**Undead Nature**：You are immune to poison damage, and you can't be poisoned. You don't require air, food, drink, or sleep.\n**Darkvision**：You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray.\n**Languages**：You can't speak, but you can understand the languages you knew in life."
  }
]